{
  "version": "1.0",
  "last_updated": "2024-08-18",
  "access_control": "público",
  "title": "Doble Titulación - ParisTech",
  "description": "El programa de doble titulación con ParisTech permite a los estudiantes de ciertas carreras de la Universidad Javeriana obtener títulos tanto de la PUJ como de ParisTech. Los estudiantes deben completar el 75% de los créditos en la PUJ y pasar 2 años en una de las escuelas de ParisTech.",
  "details": [
    {
      "subtitle": "Descripción del Programa",
      "content": "El programa con ParisTech es una doble titulación complementaria para estudiantes de Ingeniería, Nutrición, Matemática y Ciencias de Datos. Se deben cursar el 75% de los créditos del pregrado en la Universidad Javeriana y 2 años en la escuela de ParisTech, más un trabajo de grado. En Ingeniería, el trabajo de grado debe incluir elementos de diseño, manejo de restricciones reales y utilización de estándares de la disciplina.",
      "link": ""
    },
    {
      "subtitle": "Escuelas de ParisTech",
      "content": "La red ParisTech incluye las siguientes escuelas, cubiertas por el convenio de doble titulación con la PUJ:",
      "link": ""
    },
    {
      "subtitle": "Requisitos Generales para la Postulación",
      "content": "Los requisitos incluyen ser estudiante activo, tener un promedio igual o superior a 4.0, haber cursado o estar cursando 100 créditos al momento de la postulación, y acreditar un nivel A2 de francés.",
      "link": ""
    },
    {
      "subtitle": "Requisitos Antes de Iniciar Estudios en ParisTech",
      "content": "Ser estudiante activo en el semestre previo, haber cursado el 75% de los créditos y aprobado el Núcleo de Formación Fundamental, acreditar un nivel B2 de francés mediante el DELF o el TCF antes del 15 de junio de 2025, y no tener sanciones disciplinarias vigentes.",
      "link": ""
    },
    {
      "subtitle": "Requisitos Específicos para el Trabajo de Grado",
      "content": "El trabajo de grado realizado en la universidad de destino debe cumplir con los componentes definidos por la PUJ. Debe enviarse la descripción del proyecto a la Dirección de la carrera para su autorización. El trabajo puede presentarse en francés o inglés si es aprobado, de lo contrario, el estudiante debe traducirlo.",
      "link": ""
    },
    {
      "subtitle": "Requisitos para Obtener el Título de la PUJ",
      "content": "Haber presentado la prueba SABER PRO, cumplir con el requisito de lengua extranjera, completar el acuerdo de aprendizaje pactado con el director del programa, y entregar y aprobar el trabajo de grado.",
      "link": ""
    },
    {
      "subtitle": "Aspectos Financieros con la Javeriana",
      "content": "El estudiante debe pagar el semestre en la PUJ al momento de irse (último semestre a pagar es 2025-3). A partir del segundo semestre en ParisTech, no pagará matrícula en la PUJ, pero continuará siendo estudiante activo.",
      "link": ""
    },
    {
      "subtitle": "Aspectos Financieros con las Escuelas en ParisTech",
      "content": "Los aspectos financieros incluyen tiquetes a Paris, vivienda y alimentación (ParisTech apoya con alojamiento), seguro médico, y transporte. Los estudiantes del último semestre pueden conseguir prácticas remuneradas entre 500 y 1500 euros por mes y competir por las becas Eiffel.",
      "link": ""
    },
    {
      "subtitle": "Proceso de Postulación",
      "content": "El proceso incluye llenar un formulario de inscripción, presentar una carta de motivación, una carta de los padres, hoja de vida, certificado histórico de calificaciones y un certificado de francés nivel A2.",
      "link": "https://www.javeriana.edu.co/recursosdb/725922/786359/Formulario+de+postulaci%C3%B3n+DT+%281%29.pdf/8c90f7b3-fa53-a397-fe4d-e6c89df74322?t=1675458505568"
    },
    {
      "subtitle": "Formato de Hoja de Vida",
      "content": "Para la hoja de vida, usa el formato europeo.",
      "link": "https://europass.europa.eu/select-language?destination=/node/1"
    }
  ]
}
