{
  "version": "1.0",
  "last_updated": "2024-08-18",
  "access_control": "público",
  "title": "Programa de Doble Titulación con el Politécnico de Turín",
  "description": "Programa de doble titulación dirigido a estudiantes de ingeniería de la Pontificia Universidad Javeriana que desean obtener títulos tanto de la PUJ como del Politécnico de Turín.",
  "details": [
    {
      "subtitle": "Descripción General",
      "content": "Dirigido a estudiantes javerianos de pregrado de las carreras de Ingeniería (Civil, Industrial, Electrónica, Sistemas y demás programas de ingeniería) que hayan cursado o estén cursando su cuarto año al momento de postularse, así como, cursar o estar cursando el 100% de los créditos del núcleo de formación fundamental, con excepción de las asignaturas relacionadas con el trabajo de grado según aplique para cada ingeniería (Seminarios de proyecto de grado, Planeación de proyecto final, Trabajo de grado). El programa con el Politécnico de Turín (PoliTo) es un programa de doble titulación complementario, en el cual los estudiantes deben cursar 4 años en la Pontificia Universidad Javeriana (PUJ), los cuales son exigidos por el gobierno de Italia, y 2 años de Laurea Magistrale en el Politécnico de Turín, incluyendo el trabajo de grado. Este último, a realizarse en la universidad de destino, debe incluir explícitamente elementos de diseño, manejo de restricciones reales y utilización de estándares de la disciplina. Al finalizar el programa, los estudiantes obtendrán el título de pregrado de la Pontificia Universidad Javeriana y el título de Laurea Magistrale del Politécnico de Turín, previo cumplimiento de los requisitos de grado exigidos por la Facultad. Este convenio busca la participación de estudiantes que quieran realizar su trabajo de grado en el exterior y obtener un título de maestría en Italia. Para ello será esencial respetar la legislación italiana en la que el estudiante requiere haber cursado cuatro años en la PUJ."
    },
    {
      "subtitle": "Requisitos para la Inscripción",
      "content": "1. Ser estudiante activo en el momento de la postulación.\n2. Haber cursado o estar cursando el 100% de los créditos del núcleo de formación fundamental, con excepción de las asignaturas relacionadas con el trabajo de grado según aplique para cada ingeniería (Seminarios de proyecto de grado, Planeación de proyecto final, Trabajo de grado). En caso de reprobar las asignaturas que esté cursando requeridas para la postulación, perderá su cupo en la maestría.\n3. Tener créditos pendientes en la PUJ, tanto al momento de presentar la postulación como al momento de iniciar sus estudios en la universidad de destino. Ningún estudiante que haya culminado el plan de estudios en la PUJ, o que lo culmine en el semestre en que postula, podrá presentarse como candidato.\n4. Tener un promedio acumulado igual o superior a 3.8. El promedio ponderado acumulado que se tendrá en cuenta es el obtenido en el periodo inmediatamente anterior al que se está presentando la solicitud.\n5. No haber perdido más de 21 créditos académicos.\n6. En caso de postular para cursar un programa en Laurea Magistrale en italiano, el estudiante debe presentar un examen oficial de dominio de idioma italiano B2 (PLIDA, CILS, CELI) según el Marco Común de Referencia para las Lenguas y un examen (IELTS académico o TOEFL) de B2 de inglés. En caso de postular para cursar un programa en Laurea Magistrale en inglés, el estudiante debe presentar un examen (IELTS académico o TOEFL) de dominio de idioma de inglés B2 y un examen oficial de dominio de idioma italiano de B1 de italiano (PLIDA, CILS, CELI). En el caso de que el programa al que se postule sea en ambos idiomas, los dos exámenes deben certificar un nivel B2. Para el caso del inglés se requiere un IELTS Académico o un TOEFL con fecha de presentación posterior al 30 de junio de 2020.\n7. Debe haber cumplido con el requisito de Lengua Extranjera en la Pontificia Universidad Javeriana para obtención del Título de Profesional.\n8. No tener ningún tipo de antecedente disciplinario.\n9. Se recomienda haber presentado la prueba SABER PRO. Es responsabilidad del estudiante asegurarse de que cumplirá el requisito estando fuera del país, en caso de decidir no presentarlo en Colombia."
    },
    {
      "subtitle": "Requisitos Específicos para la Inscripción",
      "content": "Para que el trabajo de grado realizado en la Universidad de destino sea reconocido en la PUJ, debe contar con componentes de diseño de acuerdo con lo definido por el currículo. Se requiere la autorización previa del proyecto a desarrollar, para lo cual debe enviarse la descripción de este a la Dirección de cada carrera, la cual debe avalar la ejecución de dicho trabajo."
    },
    {
      "subtitle": "Aspectos Financieros",
      "content": "En el semestre en el que inicia sus estudios en el PoliTo, el estudiante debe pagar en la Pontificia Universidad Javeriana: a) media matrícula si le hacen falta de cero a 10 créditos para finalizar su programa académico en la PUJ o b) un (1) semestre de matrícula completa si le hacen falta más de 10 créditos en la PUJ.\nCosto de la vida de estudio (Aproximadamente 50 euros)\nTiquetes a Turín (Aproximadamente 1.600 euros)\nVivienda y alimentación (Mínimo 830 euros mensualmente)\nSeguro médico (Aproximadamente 250 euros por año)\nTransporte (Aproximadamente 250 euros por año)\nImpuesto a estudiantes extranjeros (Aproximadamente 160 euros por año)"
    },
    {
      "subtitle": "Inscripción al Programa",
      "content": "El estudiante interesado debe enviar por correo los siguientes documentos al Director de Programa correspondiente, dentro de los plazos establecidos en el cronograma de la convocatoria. Los documentos deben ser enviados en formato digital, en un solo archivo de PDF por estudiante, en el siguiente orden:\n1. Formulario de Inscripción diligenciado.\n2. Copia de la hoja de datos biográficos del pasaporte vigente.\n3. Carta de motivación en español dirigida a la Facultad (máximo una (1) página).\n4. Carta de los padres o acudientes en la cual certifiquen que conocen los términos, condiciones y costos del programa y que apoyan la participación del estudiante.\n5. Hoja de vida, en español y con foto, según el formato europeo (máximo 2 páginas).\n6. Certificado histórico de calificaciones por grado académico emitido por la Oficina de Admisiones y Registro. Deben solicitarlo a través de la Intranet con el código 0008. Si el estudiante realizó un preuniversitario, es necesario también incluir este certificado.\n7. Certificado de italiano (B1 o B2 dependiendo del idioma de la Laurea Magistrale en el que se hagan los estudios).\n8. Certificado de inglés (B1 o B2 dependiendo del idioma de la Laurea Magistrale en el que se hagan los estudios)."
    }
  ]
}
