{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "11_ProyectoDeDisenoEnIngenieria_33733",
    "description": "Syllabus de la materia 'ProyectoDeDisenoEnIngenieria' con código '33733'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Proyecto CDIO Año I",
        "Nombre Largo de la Asignatura": "Proyecto de diseño en Ingeniería",
        "Código de la asignatura": "33733",
        "Grado": "Pregrado",
        "Descripción": "Asignatura práctica para generar identidad de ingeniería al enfrentar a los estudiantes a un problema real. A partir de un contexto dado, los estudiantes trabajan en grupos para realizar un análisis transversal, entre lo técnico y humano, para identificar un problema pertinente. Aplicando herramientas de ingeniería, deben concebir y diseñar un prototipo de solución y generar recomendaciones para su implementación y operación. Todo lo anterior, enmarcado en la gestión de proyectos de ingeniería y con las aptitudes y capacidades de un ingeniero javeriano como eje. En esta asignatura se busca promover la vocación de servicio, para que los estudiantes se involucren en las problemáticas económicas, sociales, productivas o ambientales, y que, soportados en las herramientas de ingeniería, generen alternativas que podrían tener incidencia social. A pesar de ser una asignatura del núcleo fundamental para Ingeniería, se ofrece como electiva a toda la universidad.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisito de inscripción: //Introducción a la Ingeniería// O //Introducción a la Ingeniería Industrial// O //Introducción a la Ingeniería Civil// O //Introducción a Ingeniería de Sistemas// ó //Intro a la ingeniería Electrónica I//",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar a los estudiantes algunos principios básicos de la gestión de proyectos en ingeniería.\nPromover el desarrollo de competencias para la solución de problemas de ingeniería a través del aprendizaje basado en proyectos. \nExhibir, a partir del desarrollo de un proyecto, la influencia del uso de las herramientas de ingeniería para generar impactos positivos en ámbitos productivos, organizacionales, sociales o ambientales. \nFortalecer las habilidades técnicas de los estudiantes a partir de su implementación para la construcción de un prototipo que dé solución a una problemática real. \nGenerar identidad con la Universidad, con el programa de estudios y con su profesión desde una perspectiva ética y moral. \nGenerar los escenarios para que los estudiantes, al interactuar dentro de su equipo de trabajo y entre otros equipos, desarrollen habilidades de comunicación, trabajo en equipo y liderazgo.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nIdentificar los roles y responsabilidades de un ingeniero con la sociedad y su entorno. (CDIO 4.1.1) \nDescribir un problema con base en el análisis integral de un contexto usando como referencia las buenas prácticas en la gestión de proyectos. (CDIO 2.1.1) Nuclear A \nIdentificar los requerimientos y restricciones del diseño de ingeniería según el usuario y su contexto del problema. (4.3.1) \nAplicar herramientas de ingeniería para construir un prototipo que esté acorde a los requerimientos de desempeño establecidos. (CDIO 4.4.1) \nPreparar un plan de acción para implementar y operar el diseño propuesto usando como referencia las buenas prácticas en la gestión de proyectos. (CDIO 4.5.1,4.6.2) \nPromover un ambiente colaborativo dentro del equipo de trabajo. (CDIO 3.1.2, 4.7.1) \nExplicar, a partir de presentaciones visuales y escritas, los resultados del proyecto. (CDIO 3.2.5)",
        "Contenidos temáticos": "1. Qué es un proyecto? Qué es un proyecto de ingeniería? \n2. Análisis del contexto. \n3. Paradigma pedagógico ignaciano (PPI) y su aplicación en proyectos de ingeniería. \n4. Diseño en ingeniería según ABET: requerimientos, restricciones y estándares. \n5. enfoque ágil en proyectos de ingeniería. \n6. Enfoque multidisciplinario del diseño y soluciones del ingeniería.",
        "Estrategias Pedagógicas": "La asignatura se fundamenta en las metodologías problema based learning y passion based learning, donde los estudiantes trabajan en equipos semi-autónomos, para desarrollar por sí mismos, diversas competencias, al enfrentarse a un problema relacionado con un contexto real. Los equipos deben realizar un análisis integral del contexto, incluyendo, además de los elementos técnicos, a las personas, su entorno, sus experiencias, emociones y necesidades. A partir del análisis, cada grupo definirá un problema pertinente para el contexto y propondrá una solución. La solución debe ser prototipada usando herramientas de ingeniería. Las clases se realizarán a través de sesiones donde el profesor es el encargado de apoyar y dirigir las discusiones de cada grupo y orientar su aprendizaje autónomo.",
        "Evaluación": "Las estrategias de evaluación de esta asignatura se centran en los resultados esperados del proyecto y en el proceso observado de los estudiantes durante su desarrollo. Los componentes de evaluación de la asignatura son: \n1. Actividad de análisis del contexto (video o actividad introductoria al macro y minicontexto): 15%. \n2. Actividad de identificación del problema (video, documento o derivados): 15%\n3. Actividad sobre la solución (infografía, video, documento sobre la concepción de la solución y herramientas necesarias): 15%\n4. Documento/portafolio final que contemple contexto, problema, posibles soluciones, elección de la solución a prototipar, diseño del prototipo, plan de implementación: 15% \n5. Póster final: calificación por el docente: 10%\n6. Trabajo en equipo: coevaluación y autoevaluación en cada entrega (se califica en cada corte con un valor de 2,5%): 10%\n7. Apreciación docente y trabajo en clase: asignado por el docente y presentado con un 2,5% en cada corte: 10%\n8. presentación de posters en evento final (evaluación por pares evaluadores): 10%.",
        "Recursos Bibliográficos": "1. Project Management Institute. (2017). A Guide to the Project Management Body of Knowledge. Sixth Edition. Newton Square, Pa. \n2. Nigel, J. Smith. (2002). Engineering Project Management. Second Edition. Blackwell Science. ISBN: 0-632-05737-8. \n3. Ulrich, K., & Eppinger, S. (2004). Diseño y desarrollo de productos. Enfoque multidisciplinario. Ciudad de Mexico: McGraw-Hill. \n4. Jesuit Secondary Education Association (JSEA). (1993). Ignatian Pedagogy A Practical Approach. Originally published as a monograph; reprinted as Appendix B in The Jesuit Ratio Studiorum of 1599: 400th Anniversary Perspectives."
    }
}