{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "12_ArquitecturaYOrganizacionDelComputador_34580",
    "description": "Syllabus de la materia 'ArquitecturaYOrganizacionDelComputador' con código '34580'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Arquitectura del computador",
        "Nombre Largo de la Asignatura": "Arquitectura y organización del computador",
        "Código de la asignatura": "34580",
        "Grado": "Pregrado",
        "Descripción": "En este este curso se presenta información detallada sobre el funcionamiento del hardware, así como la interfaz que éste provee a las capas de software superiores.  El conocimiento del hardware servirá para el desarrollo de sistemas y aplicaciones que aprovechen al máximo los recursos computacionales. Para lograr los objetivos planteados se usan diversas estrategias pedagógicas tales como clases interactivas magistrales, ejercicios individuales y en grupo, así como técnicas de aprendizaje activo. Los conceptos de la teoría se refuerzan con talleres en lenguaje ensamblador",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisito de inscripción: //Introducción a la programación// o //Pensamiento Algorítmico//",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar los conceptos fundamentales de los sistemas lógicos y digitales. \nBrindar herramientas teóricas y experiencias prácticas relacionadas con la representación de datos en el computador. \nExponer al estudiante, mediante textos y clases magistrales interactivas, la organización del computador, y el funcionamiento e interacciones de los distintos componentes.  \nPresentar mejoras de los procesadores actuales para proveer mayor rendimiento",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nInterpretar las características de un problema perteneciente al contexto tecnológico actual para determinar el procesador a utilizar en el desarrollo de la solución. (CDIO 2.1) (Disciplinar 3, 4, 5)\nDescribir  diferentes modelos o estrategias para representar el comportamiento, arquitectura y funcionamiento de un procesador. (CDIO 2.1) (Todas las disciplinares)\nFormular la solución a un problema procesado utilizando arquitecturas modernas de procesadores hacia el multinúcleo reconociendo el paralelismo inherente en la integración software/hardware (CDIO 2.1) (Disciplinar 4, 5, 6)\nExplicar la integración software/hardware de la solución procesada en los diferentes lenguajes de programación para todos los niveles de abstracción del sistema (CDIO 4.4) (Disc 1, 2, 3)\nExplicar la integración software/hardware en soluciones procesadas que utilizan multihilos y multiprocesamiento (CDIO 4.4) (Disc 4, 5, 6)",
        "Contenidos temáticos": "1. Sistemas Lógicos y Digitales \n2. Representación de los datos a nivel de máquina\n3. Organización del computador\n4. Organización y arquitectura del subsistema de memoria\n5. Interacción con los Dispositivos de I/O",
        "Estrategias Pedagógicas": "Durante el curso se utilizarán 4 estrategias. La primera de ellas será el aprendizaje basado en problemas, donde se expone a los estudiantes a problemas desafiantes buscando el desarrollo de trabajo colaborativo para encontrar la solución. La segunda será el aprendizaje por proyectos, donde se propone la elaboración un producto que responda a una necesidad o problema. La tercera será el aprendizaje colaborativo, en el cual, a través de grupos de trabajo se logrará un intercambio de conocimientos e instrucción por pares para reforzar el aprendizaje significativo. Y por último, la clase magistral interactiva para la explicación de conceptos y técnicas de análisis de los procesadores.",
        "Evaluación": "Las estrategias de evaluación están centradas en la valoración de los resultados de aprendizaje esperado de la asignatura. las cuales pueden ser formativas que suscitan la comprensión y construcción de conocimiento, y sumativas que incluyen porcentajes de evaluación.\nEstas últimas son:\nCOMPONENTE PORCENTAJE\nParcial 1 20%\nParcial 2 20%\nExamen Final 20%\nProyecto de semestre 25%\nTalleres 15%",
        "Recursos Bibliográficos": "Computer Architecture: A Quantitative Approach (The Morgan Kaufmann Series in Computer Architecture and Design) by John L. Hennessy and David A. Patterson | Dec 7, 2017\nAssembly Programming and Computer Architecture for Software Engineers by Brian R. Hall and Kevin J. Slonka | Apr 1, 2017\nEssentials of Computer Organization and Architecture by Linda Null  | Mar 20, 2018\nPATTERSON, David A., HENNESSY, John L. Computer Organization and Design : The Hardware/Software Interface. Morgan Kaufmann, 1997.\nSTALLINGS, William, Organización y Arquitectura de Computadores. Prentice Hall, 1997.\nPARHAMI, Behrooz, Arquitectura de Computadoras.  Mc GrawHill Interamericana. 2007.\nVRANESIC, Zvonko.,HAMACHER, Carl. Organización de Computadores. Mc GrawHill Interamericana. 2003.\nWAKERLY, John F. Digital Design: Principles and Practices. Prentice Hall, 1994.\nPATTERSON, David A., HENNESSY, John L. Computer Architecture: A Quantitative Approach. Morgan Kaufmann, 1996."
    }
}