{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "13_ProbabilidadYEstadistica_33732",
    "description": "Syllabus de la materia 'ProbabilidadYEstadistica' con código '33732'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Probabilidad e inferencia",
        "Nombre Largo de la Asignatura": "Probabilidad y estadística inferencial",
        "Código de la asignatura": "33732",
        "Grado": "Pregrado",
        "Descripción": "Esta asignatura se enfoca en el modelamiento de fenómenos probabilísticos, con base en los principales conceptos básicos de la teoría de la probabilidad y el modelamiento de variables aleatorias. Adicionalmente se abordan modelos estadísticos que permiten inferir acerca de las características de una población. Además, la fundamentación probabilística y estadística permite una toma de decisiones y una realización de acciones mejor informadas y menos imprecisas. Por lo tanto, a través del modelamiento probabilístico y estadístico, el estudiante podrá analizar situaciones y/o problemas prácticos, reales, en los que existen diferentes grados de incertidumbre, diversos factores aleatorios y relaciones entre éstos. La asignatura está compuesta por dos módulos: i) teoría de probabilidades, donde se abordan los temas de conteo, variables aleatorias y su caracterización y ii) estadística inferencial, donde se tratan temas de estimación, pruebas de hipótesis y regresión.",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisito de inscripción: //Cálculo Integral// O //Matemáticas II//",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar los conceptos básicos de los fenómenos probabilísticos y la estadística inferencial, describiendo sus aplicaciones, ventajas e implicaciones del modelamiento estocástico y su análisis. \nBrindar las herramientas para el análisis probabilístico y estadístico, desarrollando problemas de ingeniería.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nDescribir problemas básicos de ingeniería usando modelos de probabilidad de tipo discreto y continuo, de una y varias variables (CDIO 2.1.2) (Nuclear B-C-D-E)\nInterpretar los resultados de un modelo probabilístico a través del cálculo del valor esperado, los momentos y función generatriz (CDIO 2.1.3) (Nuclear C)\nFundamentar decisiones partiendo de datos con incertidumbre por medio del uso de técnicas estadísticas (CDIO 2.1.4) (Nucleares A, y F hasta H)\nAplicar estrategias de comunicación para la redacción de informes, reportes y elaboración de gráficas de análisis inferencial y/o estadístico (CDIO 3.2) (Nuclear G-H)",
        "Contenidos temáticos": "Nuclear A. Conceptos básicos probabilidad (8 Horas)\n1.\tIntroducción\n2.\tRepaso de teoría de conjuntos, definición de espacio muestral y eventos.\n3.\tDefiniciones de probabilidad.\n4.\tAxiomas de probabilidad.\n5.\tTécnicas de conteo: principio de adición y multiplicación en conteo, permutación y combinación (experimentos con y sin repetición).\n\nNuclear B. Probabilidad condicional e independencia (6 Horas)\n1.\tProbabilidad condicional, reducción del espacio muestral.\n2.\tIndependencia, ley de la multiplicación, ley de la probabilidad total y teorema de Bayes.\n3.\t rboles de probabilidad.\n\nNuclear C. Variables aleatorias univariadas, casos especiales (10 Horas)\n1.\tFunción de probabilidad de masa y acumulada\na.\tVariables aleatorias discretas.\nb.\tVariables aleatorias continuas.\n2.\tValor esperado (esperanza matemática) y varianza \n3.\tCasos especiales:\na.\tVariables aleatorias discretas: Bernoulli, Binomial, Binomial Negativa, Geométrica, Hipergeométrica, Uniforme y Poisson.\nb.\tVariables aleatorias continuas: Uniforme, Exponencial y Normal.\n\nNuclear D. Variables aleatorias bivariadas (Recorte, preguntar a electrónica) (4Horas)\n1.\tVariables aleatorias bidimensionales (discretas y continuas).\na.\tDistribución de probabilidad conjunta.\nb.\tDistribución de probabilidad marginal.\nc.\tValor esperado de funciones de variables aleatorias.\n\nNuclear E. Estadística descriptiva (4 horas)\n1.\tVariables cuantitativas\na.\tMedidas de tendencia central, de dispersión, de posición, de forma.\nb.\tGráficos descriptivos: histograma, caja y bigotes.\n2.\tVariables cualitativas\na.\tTablas cruzadas univariadas y bivariadas (frecuencia absoluta, porcentual, condicional).\nb.\tGráficos descriptivos: barras (simples, agrupadas, apiladas).\n\nNuclear F. Muestreo y Distribuciones muestrales (6 Horas)\n1.\tTeorema del Límite Central y aplicaciones\n2.\tDistribuciones de muestreo fundamentales.  \n\nNuclear G. Teoría de estimación: estimación puntual y por intervalos (6 Horas)\n1.\tConceptos y características de la estimación (estimadores insesgados y consistentes, concepto de eficiencia)\n2.\tConceptos, elaboración y aplicación de intervalos de confianza (media y varianza de una y dos poblaciones).\n\nNuclear H. Pruebas de hipótesis (14 Horas)\n1.\tConceptos de pruebas de hipótesis (unilaterales y bilaterales) y tipos de error.\n2.\tMetodología para la realización de pruebas de hipótesis, definición del nivel de significancia y valor-p\n3.\tPruebas de hipótesis para una y dos poblaciones.\n\nNUCLEAR I. Introducción a la regresión lineal (4 horas)\n1.\tCovarianza y correlación. Diagrama de dispersión.\n4.\tRegresión lineal simple: análisis de coeficientes, ajuste, inferencia sobre parámetros y predicción usando salidas de software.",
        "Estrategias Pedagógicas": "Esta asignatura tiene una metodología de clase magistral interactiva, en donde la apropiación del conocimiento se realiza a través de la resolución de problemas probabilísticos y estadísticos. Es así como el estudiante parte de unos conceptos que debe aplicar para representar matemáticamente el problema. En consecuencia, el estudiante está llamado a proponer una solución válida al mismo, y a hacer un análisis posterior que tenga en cuenta la solución propuesta dentro del contexto del problema. Adicionalmente, cada taller en clase busca un aprendizaje entre pares donde el estudiante puede argumentar y discutir las posibles representaciones matemáticas para un problema dado, así como los resultados obtenidos.",
        "Evaluación": "Las estrategias de evaluación son la combinación de métodos, técnicas y recursos que se utilizan para valorar el aprendizaje del estudiante. Todas las estrategias utilizadas en clase tendrán un componente formativo por medio del cual se busca suscitar la comprensión y construcción de conocimiento. Por otro lado, algunas de estas estrategias tendrán un componente de evaluación el cual será utilizado para corroborar el logro de los aprendizajes y el desarrollo de las competencias en los estudiantes.\nLas estrategias de evaluación de la asignatura son:\n COMPONENTE  PORCENTAJE\n Trabajo Individual  \n1. Primer parcial  25%\n2. Segundo parcial 25%\n3. Examen final 25%\n4. Quices (todo el semestre) 15%\n Trabajo en Equipo  \n5. Talleres en clase Todo el semestre 10%",
        "Recursos Bibliográficos": "Wackerly, D., Mendenhall, W., Scheaffer, R. Estadística matemática con aplicaciones. Cengage Learning, México, 7a Edición, 2013.\nWalpole, R. Probabilidad y estadística para ingeniería y ciencias. Pearson Educación 8va edición, México, 2007.\nMontgomery, D. Probabilidad y estadística aplicadas a la ingeniería. Limusa Wiley 2da edición, 2002.\nHines, W. Probability and statistics in engineering. Wiley India Pvt. Limited 4th edition, 2008.\nAlvarado, J., Obagi, J. Fundamentos de inferencia estadística. Editorial Javeriana. 1ra edición, 2008.\nRoss, S. A first course in probability. Pearson education, 8th edition, 2010."
    }
}