{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "17_SignificacionTeologica_2544",
    "description": "Syllabus de la materia 'SignificacionTeologica' con código '2544'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Significación Teológica",
        "Nombre Largo de la Asignatura": "Significación Teológica",
        "Código de la asignatura": "2544",
        "Grado": "Pregrado",
        "Descripción": "Esta asignatura propone una lectura crítica y sistemática de las diferentes racionalidades y los sentidos de la pregunta por Dios en la existencia del hombre. Así mismo, presenta la experiencia de fe cristiana como un horizonte de sentido valido en la búsqueda de la trascendencia y transformación personal y social. La asignatura busca fortalecer en los estudiantes su capacidad de entender y promover el diálogo entre fe, cultura y ciencia desde la opción por los que más sufren, y desde allí, permitir la elaboración de propuestas éticas innovadoras para la transformación de la sociedad. (Cf Apuntes campo de Teología y Cultura).\nLa reflexión teológica desde esta asignatura ofrece algunas herramientas conceptuales que le permitan al estudiante abordar el sentido de lo religioso como experiencia básica de tipo antropológico.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Req inscripción: Proyecto CDIO Año I /o/ Proy dise ingeniería /o/ (Planes anteriores Ingeniería [ISIST01, IC01, IINDS01, IELEC01, IELEC02, IELEC02, IELE222, ISIS301, ISIS202, IIND202, IIND202, ICIV222, ICIV301, ICIVL01, ICIVL01]: Sin condiciones)",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Brindar elementos conceptuales que permitan comprender el quehacer de la racionalidad teológica como posibilidad de interpretar y entender la realidad personal del ser humano.\nObjetivos Específicos:\t\nAbordar desde una fundamentación epistemológica la estructura conceptual del lenguaje y sus diversas expresiones (sentido común, religioso, filosófico, teológico, científico). \nProponer la construcción de un mundo incluyente, solidario, justo y fraterno iluminado desde la praxis histórico-liberadora de Jesús, donde el estudiante sea sujeto de su propia historia y responsable de su transformación.\nReflexionar desde la experiencia cristiana la responsabilidad que tiene el hombre con la creación, su  cuidado, protección y aseguramiento de la misma para las generaciones actuales y futuras.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso, el estudiante estará en capacidad de: hacer inteligibles los valores, las estimulaciones existenciales, el patrón de conducta y el proyecto de vida cuando hablamos de Dios; reducir la brecha entre la profesión de fe institucional y la fe vivida por los jóvenes; actualizar la comprensión de la palabra Dios posibilitando que los estudiantes se vinculen a una experiencia personal existencia y vivencial; realizar juicios que puedan reconocer la valía de otras propuestas o experiencias religiosas; y hacer uso de los conceptos teológicos que ofrece la asignatura para comprender la realidad y transformarla a partir de su relación con el misterio, con los otros y con la naturaleza.",
        "Contenidos temáticos": "Unidad 1\nAproximación a las diferentes racionalidades:\n¿Qué se entiende por racionalidad?\n1.1\tLa formación Teológica en la PUJ \n1.2\tEpistemología de los lenguajes \n1.2.1\tEl lenguaje religioso\n1.2.2\tEl lenguaje teológico: replanteamiento de la experiencia religiosa\n1.2.3\tEncuentro del quehacer teológico con otros saberes\n\nUnidad 2\nTeología del ser humano\n2.1.    El hombre, realidad personal\n2.1.1. El concepto de Persona\n2.1.2. La dignidad del hombre como ser personal\n2.2.    Desarrollo armónico de la persona: dimensiones de la existencia\n2.2.1. Conocimiento de sí mismo: interioridad y corporalidad\n2.2.2. Conocimiento de los demás: ser social, comunicación, revelación del otro y libertad. \n\nUnidad 3\nTeología de la historia\n2.1      La revelación de Dios\n2.2      La experiencia de Dios a través de la historia (mirada interreligiosa e intercultural)\n2.3      El Jesús de la historia\n2.4      El evangelio de Jesús: ¿Buena nueva para hoy?\n\nUnidad 4\nTeología de la creación\n3.1     Teología de la tierra\n3.2      La cuestión ambiental y el sujeto co-creador\n3.3      Compromiso frente a la creación: el cuidado de la casa común.",
        "Estrategias Pedagógicas": "Las estrategias pedagógicas tienen relación con los siguientes criterios: logro de objetivos, dominio del tema, participación, responsabilidad, trabajo en equipo y la argumentación, por eso se promueven estrategias activas como el trabajo personal y en equipo, las exposiciones de los participantes, los talleres individuales y colectivos, debates y paneles, y el uso de recursos digitales. Las lecturas suponen una comprensión fundamental que permita entrar en discusiones razonables que permitan el avance en los temas.",
        "Evaluación": "La evaluación es concebida como proceso y, en consecuencia, aunque haya momentos de evaluación sumativa, se tendrá en cuenta lo realizado por el estudiante en cada una de las sesiones y en los tiempos de trabajo independiente. \nLa evaluación sumativa tendrá la siguiente distribución: \n1.Primera",
        "Recursos Bibliográficos": "Unidad 1\nCALVO,  ngelo y RUIZ, Alberto. Para una cristología elemental. Verbo Divino.  Cap. 1 El hecho religioso y el hecho cristiano. 2002. pg. 5-17.\nEQUIPO DE EUCARIST A ¿ Jesucristo. Condensado por Malagón C, Gilberto, El lenguaje de la Biblia. Edit. Verbo, Bogotá, 1980 *\nKOLVENBACH, Peter-Hans, S.J. Alocución del Superior General de la Compañía de Jesús, en la inauguración de la nueva sede de la Facultad de teología de la Universidad Javeriana. Bogotá, 2001. *\nMEZA, José Luis. Formas dialógicas de la teología: Sobre la necesidad del encuentro con los otros saberes para el quehacer teológico (texto gris), pp. 1-19. *\nREMOLINA, Gerardo, S.J. Los Fundamentos de una ilusión. Bogotá: Editorial Javeriana, 2016.\nRESCHER, Nicolás. La racionalidad. Una indagación filosófica sobre la naturaleza y la justificación de la razón. Editorial Teonos., Madrid, 1993.Paginas: 13 ¿ 33 y 244 ¿ 250.\nVELEZ CORREA, Jaime., Análisis del fenómeno Religioso.  Al encuentro de Dios. Filosofía de la religión. Vol.1. CELAM. Bogotá. 1991. P. 61-91.\nCARRASQUILLA, Jesús María: Teología e interculturalidad.  http://revistas.javerianacali.edu.co/index.php/teologiaysociedad/article/view/379\nMART NEZ BULLÉ Víctor M ¿GOYRI. Reflexiones sobre la dignidad humana en la actualidad.www.bibliojuridica.org\nFUNES Rubén. Acerca de tres dimensiones del ser humano. En Teoría y Praxis. No 11, Junio 2007\n\nUnidad 2\nARIZA, Julio César. La formación integral en la Iglesia. Bogotá: Ediciones Javeriana, 2005.\nBAUMAN, Z. Modernidad líquida. Buenos Aires. Fondo de Cultura Económica. 1999. *\nBAUMAN, Z. La cultura en el mundo de la modernidad líquida. Fondo de Cultura Económica, Buenos Aires, 2013.\nMEZA, José Luis. ¿El ser humano como realidad cosmoteándrica¿. Cuestiones teológicas Vol. 36, N. 85 (2009): 59-80. *\nRU Z PÉREZ, FRANCISCO JOSÉ. ¿Antropología teológica¿, en Nuevo diccionario de teología, dirigido por Juan\nJosé Tamayo. Madrid: Trotta, 2005. *\nRU Z DE LA PEÑA, JUAN LUIS. Imagen de Dios. Antropología teológica fundamental. Santander: Sal Terrae, 1988.\nCORTINA, Albert; SERRA, Miquel- ngel (eds.) ¿Humanos o posthumanos? Singularidad tecnológica y mejoramiento humano, Editorial Fragmenta: Barcelona, 2015.\nREMOLINA. Gerardo, S.J. Los fundamentos de una ilusión.  Bogotá: Editorial Javeriana, 2016 págs.36-76\n \nUnidad 3\nBAENA Gustavo S.J.  Apuntes de Cristología: Universidad.  Javeriana. Bogotá, 2001.\nCALVO  ngelo Y RUIZ Alberto. Para una cristología elemental. Verbo Divino.  Cap. 6 La tierra de Jesús. 2002. pg. ¿ 57- 72. *\nCASTILLO E. Jose Maria. El proyecto de Jesús. JES S Y LA LIBERTAD Capítulo 1. Pg. 12¿31. Edit. Sígueme. Salamanca, 1996. *\nGALINDO Florencio. Historiografía Bíblica. Unidad 1. Una historia sui géneris. Pág. 41-77.\nGONZ LEZ BUELTA, Benjamín. Tiempos de crear. Cap. 2: La utopía y lo germinal. Sal Terrae. Santander, 2009. 29-61. *\nROBLES ROBLES Amando. Repensar la religión, de la creencia al conocimiento. Edit. Heredia. Euna, 2001, págs. 371. *\nFUNES Rubén. Acerca de tres dimensiones del ser humano. En Teoría y Praxis. No 11, junio 2007\n\nUnidad 4\nBOFF. Leonardo. El cuidado necesario. Madrid: Trotta, 2012. págs. 81-100\nC CERES AGUIRRE Alirio, CASTIBLANCO John Jorge, D AZ F Carlos Hernando, MAHECHA Germán Roberto Y PEDRAZA. Nohora Inés Evolución de la cuestión ecoteológica en la teología de la liberación. \nVisión ecológica y supervivencia planetaria. Comisión teológica Internacional de la EATWOT. Yogyakarta. Indonesia 2012.\nFRANCISCO. Encíclica Laudato Si¿. Vaticano: Editorial Vaticana, 2015. *\nPIGEM, Jordi. Buena crisis. Barcelona: Kairós, 2010. *\nTULA, Santiago. Responsabilidad Social Empresarial. Revista: Valores en la sociedad Industrial. No 52. P. 46-56. nov. 2001.\nFRANCISCO. Encíclica Fratelli Ttuti (sobre la fraternidad y la amistad social) 2019\n\nBibliografía Complementaria\nCHARPENTIER, Etienne. Para leer el Antiguo Testamento. Editorial Verbo Divino.1985.\nELIADE Mircea, Historia de las Creencias y de las Ideas Religiosas. Editorial Cristiandad. Madrid.1988.\nESTRADA, Juan Antonio. Razones y sinrazones de la creencia religiosa. Madrid. Trotta. 2001.\nGISPERT, Carlos. Religiones del mundo. Barcelona: Océano, 2004.\nHEINNCH, Fríes. Teología fundamental. Teoría científica. Ed. Herder. Barcelona. 1987. 171-176.\nKUNG, Hans. Existe Dios. Ediciones Cristiandad. 1975.\nMARDONES, J.M.  ¿A dónde va la religión? Cristianismo y religiosidad en nuestro tiempo.  Santander: Sal Terrae, 1996.\nMARDONEZ, José María. Síntomas de un retorno. La religión en el pensamiento actual. Santander: Sal Terrae, 1999.\nPIKAZA, Xabier. Experiencia religiosa y cristianismo, Sígueme, Salamanca, 1997.\nRIFKIN, Jeremy, El fin del trabajo. Nuevas Tecnologías contra puestos de trabajo: el nacimiento."
    }
}