{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "19_SistemasDeInformacion_4082",
    "description": "Syllabus de la materia 'SistemasDeInformacion' con código '4082'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Sistemas de Información",
        "Nombre Largo de la Asignatura": "Sistemas de información en la organización",
        "Código de la asignatura": "4082",
        "Grado": "Pregrado",
        "Descripción": "Este curso expone y aplica conceptos básicos necesario para entender industrias, organizaciones, y modelos de negocio tradicionales y digitales. En adición, se discuten diferentes aspectos de sistemas de información modernos y su relación con los diferentes elementos organizacionales mencionados anteriormente con el fin de desarrollar la habilidad de los estudiantes de entender y participar en procesos de transformación digital en organizaciones de diferentes tamaños, naturaleza, y actividad económica. La metodología del curso se basa en lecturas de casos de estudio, discusiones, y talleres en clase tendientes a afianzar conceptos y herramientas; y un proyecto del curso en donde se apliquen todos los conceptos vistos en el curso con un fuerte componente de trabajo en equipo.",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisitos de inscripción: (Pensamiento Sistémico /y/ Bases de datos) /o/ (Pensamiento Sistémico /y Correquisito/ Bases de datos)",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Exponer una definición de organización basada en procesos de creación de valor \nExponer una definición clara de un sistema de información con sus respectivos componentes.  \nMostrar la pertinencia de los sistemas de información, y las tecnologías digitales en general, para apoyar la gestión eficiente de los procesos de negocio en una organización empresarial. \nBrindar herramientas y técnicas que permitan modelar un proceso de negocio que contribuya a la generación de valor en una organización empresarial. \nAprender a automatizar procesos de negocio que muestren la ventaja de utilizar sistemas de información para mejorar los objetivos estratégicos de una organización empresarial.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nRAE 1: Entender el papel de los sistemas de información en una organización, a partir del entorno, capacidades internas y propuesta de valor a futuro. (Disciplinar 1 y 2) (CDIO 2.3)  \nRAE 2: Identificar en una organización empresarial oportunidades de mejora, solución de problemas o innovación en sus sistemas de información. (Disciplinar 2 y 3) (CDIO 4.2)  \nRAE 3: Analizar y proponer alternativas de mejoramiento, basadas en el modelado de un proceso de negocio (TOBE) que contribuya con la creación de valor en una organización empresarial. (Disciplinar 3) (CDIO 2.1)  \nRAE 4: Adquirir herramientas de trabajo en equipo que le permita a cada estudiante colaborar con sus compañeros en el proceso de automatización de un proceso de negocio en una organización empresarial. (Disciplinar 1, 2, y 3) (CDIO 3.1)",
        "Contenidos temáticos": "Concepto y componentes de un Sistema de Información \nTipos de Sistemas de Información y su aporte en las diferentes áreas funcionales de una empresa \nConcepto y ejemplos de procesos de negocio en las organizaciones \nImpactos económicos de los Sistemas de información en las organizaciones empresariales \nTécnicas para el levantamiento de requerimientos de información en una organización empresarial. \nInfraestructura de TI y tecnologías Emergentes \nGestión de procesos de Negocio (BPM) \nNotación de Procesos de Negocio (BPMN) \nAplicación práctica de Modelado de procesos de Negocio \nAutomatización de procesos con BPMS",
        "Estrategias Pedagógicas": "El curso contempla 5 estrategias pedagógicas principales. La primera consiste en la realización de talleres y ejercicios en clase con los que se busca afianzar en los estudiantes los conceptos vistos en clase. En ocasiones estos talleres serán comenzados en clase y terminados por fuera por los estudiantes, o tendrán que ser preparados con anticipación. La segunda estrategia consiste en el uso de casos de estudio para proyectos, talleres, ejemplos de clase, o evaluaciones. Con esto se busca exponer a los estudiantes a casos reales que ilustren los conceptos vistos en clase. La tercera es un proyecto de curso en el que los estudiantes tendrán que aplicar todo lo visto en clase en una empresa real o diseñada por el profesor del curso. La cuarta estrategia consiste en un enfoque en trabajo en equipo que se verá reflejada en los talleres y en el proyecto del curso. Finalmente, están las presentaciones magistrales con puntos de discusión grupal y reflexión constantes.",
        "Evaluación": "Las estrategias de evaluación están centradas en la valoración de los resultados de aprendizaje esperado de la asignatura; las cuales pueden ser formativas que suscitan la comprensión y construcción de conocimiento, y sumativas que incluyen porcentajes de evaluación con el fin de corroborar el logro de los aprendizajes y el desarrollo de las competencias en los estudiantes.\n\nLas estrategias de evaluación de la asignatura son:  \nProyecto del curso (1a entrega) 10% \nProyecto del curso (2a entrega)   5% \nProyecto del curso (3a entrega)  15% \nParcial 1 - 20%  \nParcial 2 - 20%  \nTalleres y trabajo en clase - 30%",
        "Recursos Bibliográficos": "Laudon, Kenneth, y Jane Laudon. Sistema de información gerencial. 12va Edición. México, D.F., México: Pearson, 2013. \nKendall, Kenneth, y Julie Kendall. Análisis y diseño de sistemas. 8va Edición. México, D.F., México: Pearson Educación de México, 2011. \nDumas, Marlon. Fundamentals of business process management. 1st ed. New York: Springer, 2013. \nWeill, P. & Ross, J. W. (2004), IT governance: how top performers manage IT decision rights for superior results, Harvard Business School Press, Boston."
    }
}