{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "1_CalculoDiferencial_1295",
    "description": "Syllabus de la materia 'CalculoDiferencial' con código '1295'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Cálculo Diferencial",
        "Nombre Largo de la Asignatura": "Cálculo Diferencial",
        "Código de la asignatura": "1295",
        "Grado": "Pregrado",
        "Descripción": "Este curso presenta el estudio de las funciones en una variable, comenzando con la presentación de los números reales, desigualdades, valor absoluto e intervalos. Límites y continuidad, derivadas y optimización de las funciones en una variable.",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Sin condiciones",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar conceptos y herramientas para generar vínculos analíticos entre el razonamiento conceptual, la representación gráfica y la expresión verbal de funciones. \nPresentar las aplicaciones del cálculo diferencial en una variable, a través del planteamiento y resolución de problemas. \nAplicar los criterios de la derivada para analizar los extremos de funciones y aplicar la derivada en problemas de optimización. \nUtilizar herramientas computacionales para el estudio del comportamiento de las funciones de valor real \nUtilizar el concepto de derivada como herramienta para el estudio de razones de cambio.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nDescribir fenómenos asociados a problemas básicos de ingeniería, ciencias económicas y otras áreas mediante el uso de funciones de valor real. \nDesarrollar habilidades para cálculo de límites y derivadas, que permitan al estudiante explicar el comportamiento de problemas básicos en su área de formación. \nExplicar el comportamiento de la solución de un problema básico de ingeniería, ciencias económicas y otras áreas, a través del concepto de límites y continuidad de la función de valor real que lo caracteriza. \nDeterminar la solución de un problema de optimización en ingeniería, ciencias económicas y otras áreas por medio de la derivada.",
        "Contenidos temáticos": "Definición de función y tipos de funciones  \nFunción polinómica, función lineal: ecuación de la recta, cálculo de punto pendiente\nAplicación de la factorización de polinomios con coeficientes enteros, en la búsqueda de las raíces de un polinomio, para encontrar el dominio de una función de la forma: (P(x))/((x))\nDominio de las funciones de la forma ¿(g(x)) utilizando herramientas para la solución de inecuaciones lineales y polinómicas de grado 2\nCirculo unitario y manejo básico de expresiones trigonométricas.\nDominio y rango de funciones trigonométricas\nFunción a trozos, dominio y rango \nFunciones y sus gráficas.\nProblemas de Modelos matemáticos: un catálogo de funciones esenciales.\nTransformaciones de funciones y operaciones con funciones.\nFunción inversa.\nIntroducción gráfica al concepto de límites.\nLimites laterales y su cálculo por medio de gráficas.\nPropiedades de los límites y reglas para el cálculo de límites.\nCálculo de límites de funciones racionales.\nLimites notables y sus aplicaciones al cálculo de límites trigonométricos.\nLímites infinitos y límites al infinito.\nAsíntotas verticales y horizontales.\nFunciones continuas, Continuidad en un punto.\nContinuidad en un intervalo.\nClasificación de discontinuidades.\nTeorema de Bolzano y Teorema de valor intermedio.\nClasificación de discontinuidades (infinitas, de salto, evitables).\nDefinición y ejemplos de derivadas. Tasa de variación instantánea.\nConceptualización geométrica.\nReglas de derivación: suma, producto y cociente.\nDerivadas a través de tablas y cálculo de derivadas básicas.\nRegla de la cadena.\nDerivada implícita.\nRazones de cambio relacionadas\nValores extremos de una función.\nPuntos críticos.\nCriterios de primera y segunda derivada.\nConstrucción de gráficas.\nRegla de L’hopital\nProblemas de optimización.\nProblemas de Optimización",
        "Estrategias Pedagógicas": "Esta asignatura tiene una metodología de clase magistral interactiva, en donde la apropiación del conocimiento se realiza a través de la resolución de problemas. Es así como el estudiante parte de unos conceptos que debe aplicar para representar matemáticamente el problema. En consecuencia, el estudiante está llamado a proponer una solución válida al mismo, y a hacer un análisis posterior que tenga en cuenta la solución propuesta dentro del contexto del problema. Adicionalmente, cada taller en clase busca un aprendizaje entre pares donde el estudiante puede argumentar y discutir las posibles representaciones matemáticas para un problema dado, así como los resultados obtenidos.",
        "Evaluación": "Las estrategias de evaluación son la combinación de métodos, técnicas y recursos que se utilizan para valorar el aprendizaje del estudiante.\nTodas las estrategias utilizadas en clase tendrán un componente formativo por medio de la cual se busca suscitar la comprensión y construcción de conocimiento. Por otro lado, algunas de estas estrategias tendrán un componente de evaluación el cual será utilizado para corroborar el logro de los aprendizajes y el desarrollo de las competencias en los estudiantes.\n\n1.Semana 6 - Primer Parcial: 25%.\n2.Semana 11 - Segundo Parcial: 25%.\n3.Semana 17 - Tercer Parcial: 25%.\n4.Cuarta nota 25%:\n-Talleres (3) \n-Quices en plataforma (3) \n\nAdicionalmente el estudiante tendrá evaluaciones formativas que permitan al estudiante tener experiencias enriquecedoras en el curso y además desarrollar la capacidad de trabajo en grupo y el sentido de responsabilidad, comprometiéndose con su aprendizaje y descubriendo diversas aplicaciones del cálculo diferencial en su área de interés.",
        "Recursos Bibliográficos": "Texto guía: Stewart, J. (2018). Cálculo de una variable: trascendentes tempranas. Mexico: Cengage.\nTextos complementarios:\nBriggs, W. L., Cochran, L., Gillett, B., Schulz, E. P. (2018). Calculus: Early Transcendentals. United Kingdom: Pearson Education.\nSmith, R. T., Minton, R. B., Rafhi, Z. A. T. (2019). Cálculo: trascendentes tempranas. Spain: McGraw-Hill/Interamericana Editores, S.A. de C.V.\nLinks: https://es.symbolab.com/, https://www.geogebra.org/, https://www.wolframalpha.com/ \nSoftware:\nMaple- MATLAB-Python; Rstudio (interphase)"
    }
}