{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "20_GestionDeProyectosDeInnovacionYEmprendimientoDeTI_34803",
    "description": "Syllabus de la materia 'GestionDeProyectosDeInnovacionYEmprendimientoDeTI' con código '34803'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Gestión de innovación en TI",
        "Nombre Largo de la Asignatura": "Gestión de proyectos de innovación y emprendimiento de tecnologías de la información",
        "Código de la asignatura": "34803",
        "Grado": "Pregrado",
        "Descripción": "Esta asignatura aborda la gerencia de proyectos, la innovación y el emprendimiento como ejes centrales de formación. Al finalizar el curso el estudiante estará en capacidad de identificar los componentes principales de la gestión de proyectos de TI, también de la formulación de ideas creativas e innovadoras a problemas y oportunidades de negocio centradas en la aplicación de las tecnologías de la información y la comunicación (TI), potencialmente sensibles de convertirse en emprendimientos de base tecnológica.\n\nLa asignatura combina las clases magistrales con el trabajo en equipo y talleres asociados a proyectos específicos desarrollables a lo largo del semestre.",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisitos de inscripción: Gestión financiera en TI /o/ Finanzas básicas",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar el marco de referencia para la gerencia proyectos en sus componentes principales recomendados por el Project Management Institute (PMI). \nBrindar herramientas para identificar ideas y oportunidades de emprendimiento de base tecnológica sustentadas en la aplicación de TI. \nBrindar herramientas que permitan hacer uso del pensamiento creativo y la innovación en el diseño de propuestas de emprendimiento de base tecnológica en TI. \nBrindar herramientas que permitan estructurar proyectos de emprendimiento de base tecnológica, formas de validación en el mercado, y comunicación ante potenciales evaluadores o inversionistas.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nComprender los modelos y aspectos financieros, organizacionales y de planeación involucrados en el desarrollo de un proyecto de ingeniería explicando los elementos generales de la gestión de proyectos que propone el PMI en el PMBOK (CDIO 4.2) (Nuclear 1) \nIdentificar ideas y oportunidades de emprendimientos de base tecnológica sustentadas en la aplicación práctica de las TI (CDIO 4.2) (Nuclear 2) \nReportar mediante el uso de herramientas de creatividad e innovación el diseño de un modelo de negocios novedoso que explota la aplicación práctica de las TI (CDIO 4.8) (Nuclear 3) \nReportar a través de informes escritos, el análisis de los resultados de la validación de un emprendimiento de base tecnológica (CDIO 3.2 y 4.8) (Nuclear 4) \nPresentar mediante informes orales ante paneles de expertos, la propuesta de un emprendimiento de base tecnológica que implique el uso intensivo de TI (CDIO, 3.2, 4.7, 4.8) (Nuclear 5)",
        "Contenidos temáticos": "Gestión de proyectos  \nIdentificación de ideas y oportunidades de emprendimientos de base tecnológica \nHerramientas para fomentar la creatividad y la innovación en emprendimientos de base tecnológica \nEstructuración de modelos de negocio, estructuras financieras y operacionales para emprendimientos de base tecnológica \nValidación de emprendimientos de base tecnológica y presentación de resultados",
        "Estrategias Pedagógicas": "Durante el curso se utilizarán 4 estrategias. La primera de ellas será el aprendizaje directivo mediado mediante clases magistrales. La segunda el aprendizaje basado en problemas mediante talleres grupales. La tercera será el aprendizaje por proyectos, donde el estudiante sustenta la idea, la oportunidad, y la propuesta de un emprendimiento aplicando TI. Por último, se utilizará el aprendizaje colaborativo, en el cual, cada equipo de trabajo refuerza su propuesta con los aportes de los expertos ante los cuales socializa su propuesta de emprendimiento.",
        "Evaluación": "La estrategia de evaluación del curso está centrada en la valoración de los resultados de aprendizaje esperados de la asignatura, los cuales permiten demostrar la comprensión y la aplicación práctica de los conocimientos adquiridos. La estrategia de evaluación de la asignatura se valorará de la siguiente manera:   \n\nEl proceso de desarrollo una propuesta de emprendimiento seguido durante el desarrollo del curso (30%).  \nEl documento del proyecto del curso incluyendo el modelo de negocio, su estructura financiera y operacional (20%).  \nEl prototipo de la propuesta de emprendimiento de base tecnológica y un documento que soporte el análisis de los resultados de validación (30%).  \nPitch y/o presentación final del proyecto ante el panel de expertos (20%)",
        "Recursos Bibliográficos": "Recursos básicos:  \nBarrientos, E., & Farhat Borges, R. (2004). Emprendimientos sociales sosteniblesCómo elaborar planes de negocios para organizaciones socialesEmpreendimentos sociais sustentáveis (No. LC-0289). McKinsey y CompanyMcKinsey y Company. \nKawasaki, G. (2015), El Arte del Comienzo 2.0, Edit. Paidós. \nde Bes, F. T. (2005). El libro negro del emprendedor. Guia illustrada on es mostra els principals problemes que tenen els emprenedors a la hora de passar de la idea al desenvolupament de la mateixa. \nBessant, J., & Tidd, J. (2007). Innovation and entrepreneurship. John Wiley & Sons. \nOsterwalder, A., Pigneur, Y. (2011), Generación de Modelos de Negocio, John Wiley & Sons.  \nRose, K. H. (2013). A Guide to the Project Management Body of Knowledge (PMBOK  Guide) - Fifth Edition. Project management journal, 44(3), e1-e1. \n\n\nRecursos complementarios: \nOrtiz, Efrain, Nagles Nofal. (2013). Gestión de tecnología e Innovación, teoría, proceso y práctica. EAN, Bogotá. Segunda Edición, Texto de Apoyo. \nBYGRAVE, William. The Portable MBA in Entrepreneurship. Wiley, 1997. \nCHESBROUGH, Henry (2006). Open Innovation. HBSP. NY. \nDrucker, P. (1995), ¿La Sociedad Post-Capitalista¿, Norma, Bogotá, Cap. 1. \nHAMEL G. y Breen B. (2008) El Futuro de la administración, Grupo Editorial Norma, Harvard Business School Press. Bogotá. \nTidd Joe, Bessant John y Pavitt Keith (1997), Management Innovation, John Wiley & Soons, Chichester - New York."
    }
}