{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "22_SistemasOperativos_4085",
    "description": "Syllabus de la materia 'SistemasOperativos' con código '4085'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Sistemas Operativos",
        "Nombre Largo de la Asignatura": "Sistemas Operativos",
        "Código de la asignatura": "4085",
        "Grado": "Pregrado",
        "Descripción": "En la asignatura se estudia la definición, principios de diseño y funciones de un sistema operativo. El conocimiento de estos elementos, desde el punto de vista teórico y práctico, permitirá a los estudiantes desarrollar aplicaciones concurrentes que hagan un uso eficiente de los recursos computacionales.  Para lograr los objetivos planteados se usan diversas estrategias pedagógicas tales como clases interactivas magistrales, ejercicios, talleres, trabajos en grupo y técnicas de aprendizaje activo. Los conceptos de la teoría se refuerzan en el laboratorio usando un sistema operativo basado en Unix (e.g. Linux)",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisitos de inscripción: (Arquitectura y Organización del Computador /o/ Máquinas Digitales /o/ Diseño de sistemas con procesadores)",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "1. Exponer los conceptos fundamentales asociados a  los sistemas operativos  \n2. Presentar al estudiante elementos sobre la evolución de los sistemas operativos, en relación con el avance del hardware y las características de los sistemas actuales. \n3. Brindar al estudiante herramientas y experiencias prácticas que faciliten la apropiación de los conceptos teóricos y el desarrollo de programas concurrentes que funcionen en forma correcta y eficiente. \n4. Proporcionar al estudiante herramientas para el estudio del rendimiento de programas concurrentes",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nExplicar las principales funciones, estrategias y principios de diseño de los sistemas operativos, así como su relación con el hw.  (Disciplinar 1) (CDIO 2.1) \nConocer los problemas que genera la concurrencia y explicar los diferentes mecanismos para el control de la concurrencia (Disciplinar 3) (CDIO 2.1) \nUtilizar servicios del sistema operativo para la implementación de programas concurrentes que cooperan en la solución de un problema (Disciplinar 4) (CDIO 4.5) \nUtilizar herramientas y métricas que permitan evaluar el desempeño de los programas (Disciplinar 5) (CDIO 2.2)",
        "Contenidos temáticos": "1. Definición y principios de diseño de los sistemas operativos \n2. Funciones de los sistemas operativos \n3. Concurrencia y paralelismo.  \n4. Desarrollo programas concurrentes.  \n5. Pruebas de rendimiento",
        "Estrategias Pedagógicas": "Durante el curso se utilizarán 5 estrategias. La primera de ellas será el aprendizaje directivo mediado por clases magistrales interactivas. La segunda es el aprendizaje basado en problemas mediante talleres individuales o grupales, donde se expone a los estudiantes a problemas de complejidad sencilla, que refuerzan los conceptos y son útiles para la elaboración de los proyectos del curso. La tercera será el aprendizaje por proyectos, donde se propone la elaboración de una solución que responda a un problema acotado. Como cuarta estrategia se utilizará el aprendizaje colaborativo, en el cual, a través de grupos de trabajo se busca un intercambio de conocimientos por pares para reforzar el aprendizaje significativo\n\nAutoaprendizaje: Se promoverá dentro de los estudiantes el autoestudio, a través del manejo de tutoriales técnicos relacionados con temas asociados a la materia y a la constante lectura de artículos caracterizados por su profundidad en el área de las ciencias de la computación. Algunos temas se desarrollarán sobre la exigencia de que el estudiante prepare los temas señalados, utilizando para esto la bibliografía del curso, y en clase el profesor se concentrará en la resolución de dudas y las explicaciones complementarias.\n\nPráctica: El curso se estructura alrededor de 2 proyectos. Estos tienen como objetivo profundizar y apropiar los conceptos adquiridos en clase mediante la práctica. En estos proyectos se pretende que el estudiante: aplique los conceptos y algoritmos explicados, obtenga un mayor conocimiento de las herramientas disponibles, y aprenda a diseñar e implementar programas concurrentes. Semanalmente se realizan prácticas en los laboratorios que  contribuyen a la elaboración de los proyectos.",
        "Evaluación": "Las estrategias de evaluación están centradas en la valoración de los resultados de aprendizaje esperado de la asignatura; las cuales pueden ser formativas, que suscitan la comprensión y construcción de conocimiento, y sumativas, las cuales incluyen porcentajes de evaluación con el fin de corroborar el logro de los aprendizajes y el desarrollo de las competencias en los estudiantes. Las estrategias de evaluación de la asignatura son: \n\nPrimer Parcial 15% \nSegundo Parcial 15%\nTercer Parcial 15% \nTalleres 15% \nProyecto 20% \nTaller de evaluación de rendimiento 10%\nQuices, ejercicios en clase 10%",
        "Recursos Bibliográficos": "Tanenbaum, A. S., & Bos, H. (2015). Modern operating systems. Pearson.\nAbraham Silberschatz , Greg Gagne, et ál. Operating System Concepts. 9 de febrero de 2021\nArpaci-Dusseau, R. H., & Arpaci-Dusseau, A. C. (2018). Operating systems: Three easy pieces. Arpaci-Dusseau Books LLC. \nStallings, W., & Manna, M. M. (2015). Operating systems: internals and design principles. \nSilberschatz, A., Gagne, G., & Galvin, P. B. (2018). Operating system concepts. Wiley. \nAlvaro, F. (2016). LINUX: Easy Linux For Beginners, Your Step-By-Step Guide To Learning The Linux Operating System And Command Line. CreateSpace Independent Publishing Platform. \nRobbins, K. A., & Robbins, S. (1995). Practical UNIX programming: a guide to concurrency, communication, and multithreading. Prentice-Hall, Inc."
    }
}