{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "27_FisicaMecanica_1340",
    "description": "Syllabus de la materia 'FisicaMecanica' con código '1340'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Física Mecánica",
        "Nombre Largo de la Asignatura": "Física Mecánica",
        "Código de la asignatura": "1340",
        "Grado": "Pregrado",
        "Descripción": "La formación de estudiantes de la Pontificia Universidad Javeriana, PUJ, desde una visión integral enfatiza en la apropiación del conocimiento necesario para los profesionales de la ingeniería, en particular los temas de las ciencias básicas y entre ellos por supuesto, los de la física. El curso de física mecánica está dirigido a potenciar las características particulares de cada uno de los grupos de estudiantes en situaciones problema con el propósito de generar interés y motivación frente a la asignatura y buscando fomentar el desarrollo de habilidades y actitudes para la indagación y generación de nuevo conocimiento.",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Pre-requisito: Cálculo diferencial //O// Cálculo integral",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "1. Diseñar actividades prácticas y análisis de casos que permitan a los estudiantes identificar y analizar los elementos de las máquinas y el movimiento de partículas, aplicando variables adecuadas y estableciendo relaciones con el entorno, así como delinear los límites de sistemas mecánicos.\n2. Dirigir actividades de análisis y resolución de problemas prácticos que permitan a los estudiantes aplicar y examinar los principios de conservación de energía, cantidad de movimiento lineal y momento angular en diversas situaciones.\n3. Guiar a los estudiantes en la resolución de problemas prácticos y análisis de casos que involucren el equilibrio y desequilibrio de sólidos rígidos, aplicando conceptos de fuerza, torque y principios de conservación.\n4. Organizar y asistir a los estudiantes en la interpretación de resultados experimentales mediante la creación de gráficos y el análisis crítico de datos, para evaluar y extraer conclusiones significativas.\n5. Orientar a los estudiantes en la aplicación de métodos numéricos y simulaciones computacionales para modelar sistemas físicos, analizar resultados y evaluar el impacto de diferentes parámetros.\n6. Instruir a los estudiantes en el uso de instrumentos y equipos experimentales para aplicar y verificar modelos explicativos, promoviendo la práctica directa y la evaluación de la precisión de los modelos en condiciones reales.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\n1. Predecir el comportamiento de un sistema físico utilizando modelos de cinemática y dinámica en situaciones ideales.\n2. Analizar situaciones ideales que requieran la aplicación de los principios de conservación de energía, cantidad de movimiento lineal y momento angular. \n3. Resolver problemas de equilibrio de un sólido rígido mediante la aplicación de conceptos de fuerza, torque y conservación.\n4. Interpretar resultados experimentales de manera gráfica y analítica.\n5. Evaluar la efectividad de las acciones personales y las de los compañeros, asumiendo las consecuencias y reconociendo oportunidades de mejora en situaciones de trabajo en grupo.",
        "Contenidos temáticos": "UNIDADES.\n1. Cinemática y Dinámica del Movimiento generalizado. Leyes de Newton.\n2. Fuerzas conservativas y no conservativas y el Principio de Conservación de la energía.\n3. Principio de Conservación de la Cantidad de Movimiento y aplicaciones: centro de masa y colisiones.\n4. Estática y Dinámica del Sólido Rígido.\n5. Principio de Conservación del Momento angular y aplicaciones.",
        "Estrategias Pedagógicas": "- Desarrollo de talleres de ejercicios en el aula de clase, como trabajo por parejas o grupos, como refuerzo de los procesos de apropiación de los conceptos estudiados y como oportunidad de realización de retroalimentación de los conceptos estudiados.\n- Desarrollo de problemas experimentales de verificación que le permitan al estudiante poner en práctica el trabajo en grupo, comprender la fundamentación teórica de los diversos equipos y aplicar apropiadamente el uso y manejo adecuado de ellos.\n- Desarrollo de talleres de trabajo autónomo dirigido, a través de los cuales el estudiante tiene la posibilidad de fortalecer los conceptos y desarrollar actividades de análisis y solución de las situaciones cotidianas.\n- Aplicación de evaluaciones cortas o quices, donde el estudiante tiene la posibilidad de poner en práctica la apropiación conceptual de la fundamentación teórica estudiada.\n- Presentación de trabajos asignados sobre diversas temáticas donde el estudiante tiene la posibilidad de profundizar sus conocimientos mediante la búsqueda, selección y análisis de la información y se entrene en obtener, analizar y procesar información por su propia cuenta.\n- Aplicación de evaluaciones, donde el estudiante tiene la posibilidad de poner en práctica la apropiación conceptual de la fundamentación teórica estudiada.",
        "Evaluación": "1. Pruebas escritas individuales: \nPrimera evaluación parcial = 15% \nSegunda evaluación parcial = 15%\nExamen final = 30%\n\n2. Problemas teórico-prácticos e informes de laboratorio = 20% \n3. Actividades individuales y/o grupales: \nQuices y talleres de ejercicios = 20%",
        "Recursos Bibliográficos": "Bibliografía básica.\n- Sears, Zemansky, Young, Freedman, Física Universitaria, Volumen 1, decimosegunda edición, Pearson educacion, México, 2009.\n- Tipler, Paul y Gene Mosca, Física para la ciencia y la tecnología, Volumen 1. 6ta edición.   Reverté, S.A., Barcelona, 2010.\n\nBibliografía complementaria.\n- R. Resnick, D. Hallyday, Krane. Física Vol. 1.  5  Edición.  C.E.C.S.A, México, 2002\n- Alonso, Finn, Física, ADDISON-WESLEY IBEROAMERICANA, U.S.A., 1995\n- Serway,  Jewet.  Física I Texto basado en cálculo, 3  edición. Editorial Thomson, México, 2004.\n- Wolfgang Bauer, Gary d. Westfall. Física para Ingeniería y Ciencias. Mc Graw Hill ISBN 978 607 15 0545 3. 2011."
    }
}