{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "29_OptimizacionYSimulacion_34866",
    "description": "Syllabus de la materia 'OptimizacionYSimulacion' con código '34866'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Optimización y simulación",
        "Nombre Largo de la Asignatura": "Optimización y simulación",
        "Código de la asignatura": "34866",
        "Grado": "Pregrado",
        "Descripción": "En ambientes empresariales es necesario tomar decisiones a niveles estratégicos, tácticos y operativos, que permitan alcanzar soluciones óptimas, cercanas a las óptimas, o adecuadas de acuerdo al contexto, teniendo en cuenta las complejidades de los problemas y por ende las múltiples restricciones. En la primera parte, esta asignatura hace énfasis en el reconocimiento de problemas susceptibles de ser optimizados, y su modelado matemático basado en la programación lineal. En la segunda parte, se introduce la simulación Montecarlo y la simulación a eventos discretos, con el fin de resolver problemas matemáticos complejos a través de la generación de variables aleatorias y estimar los valores de las medidas de desempeño del sistema. Finalmente, se estudian los sistemas que evolucionan a lo largo del tiempo con una cantidad inherente de aleatoriedad, y que puedan ser representados por modelos matemáticos, como los procesos industriales, de servicios y/o los sistemas computacionales.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "ISIST02 1290 Álgebra lineal Y (4249 Probabilidad y estadística O 33732 Probabilidad e inferencia) o  ISIST01 4249 Probabilidad y estadística O 33732 Probabilidad e inferencia o Ing. Civil: 1290 Algebra lineal Y  4249 probabilidad y estadística",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "- Brindar herramientas de optimización para el planteamiento y resolución de problemas de ingeniería utilizando la programación lineal.\n- Generar un vínculo analítico y coherente entre el contexto del problema, la representación matemática del mismo y los resultados numéricos a través de la implementación de los modelos en software especializado.\n- Brindar las herramientas para el análisis descriptivo y predictivo de problemas de ingeniería utilizando los modelos estocásticos clásicos.\n- Presentar el modelamiento de fenómenos estocásticos mediante casos de estudio aplicados, destacando los usos, ventajas e implicaciones de este tipo de modelamiento.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\n- Diseñar un modelo de un problema, de carácter teórico o aplicado, utilizando la programación lineal/entera/entera-mixta (CDIO 2.1)(Disciplinar 1)\n- Resolver el modelo de un problema de ingeniería utilizando los métodos gráfico y simplex matricial (CDIO 2.1)( Disciplinar 1)\n- Interpretar la solución de un problema de ingeniería a partir del análisis de sensibilidad del modelo de programación lineal (CDIO 2.1)( Disciplinar 1)\n- Diseñar una representación de los eventos asociados a un problema de ingeniería mediante un proceso estocástico conocido (CDIO 2.1)( Disciplinar 2 y 3)\n- Interpretar los resultados de la implementación de un modelo estocástico con base en el contexto del problema (CDIO 2.1)( Disciplinar 2 y 3)\n- Identificar las necesidades de ajuste en un modelo computacional a partir de las métricas relacionadas con el contexto del problema modelado (CDIO 4.6)(Todas las disciplinares)",
        "Contenidos temáticos": "Disciplinar 1. Programación lineal, entera y entera-mixta\n1. Introducción a la Investigación de operaciones \n2. Estructura de los modelos de optimización\n3. Modelamiento de problemas mediante programación lineal\n3.1 Parámetros y variables continuas, enteras y binarias\n3.2 Solución por método gráfico\n3.3 Solución por software (Gusek)\n3.4 Analisis de sensibilidad\n\nDisciplinar 2. Principios generales de la simulación\n1. Principios generales de la simulación:  reas de aplicación, clasificación y tipos de sistemas\n2. Generación de números aleatorios\n3. Propiedades de los números aleatorios\n4. Método de Montecarlo\n5. Fundamentos de la simulación a eventos discretos\n6. Casos de uso de la simulación Montecarlo y eventos discretos.\n\nDisciplinar 3. Sistemas de líneas de espera (teoría de colas) \n1. Medidas de desempeño\n2. Modelos exponenciales\n3. Modelos no exponenciales\n4. Leyes operacionales",
        "Estrategias Pedagógicas": "Esta asignatura se centrará en la apropiación del conocimiento a través de una estrategia de aprendizaje basado en problemas y estudio de casos, donde el estudiante parte de unos conceptos que debe aplicar para representar matemáticamente el problema, particularmente mediante el uso de la programación lineal, la simulación Montecarlo y la teoría de colas. En consecuencia, el estudiante está llamado a proponer un modelo matemático válido que represente adecuadamente el problema, a resolverlo mediante software especializado, y finalmente a hacer un análisis posterior que tenga en cuenta la solución propuesta dentro del contexto del problema. Adicionalmente, cada caso en clase busca un aprendizaje entre pares donde el estudiante puede argumentar y discutir las posibles representaciones matemáticas para un problema dado, así como los resultados obtenidos.",
        "Evaluación": "1. Primer caso 25%\n2. Segundo caso 25%\n3. Tercer caso/examen final 30%\n4. Talleres en clase 20%",
        "Recursos Bibliográficos": "- Taha, H. A. (2004). Investigación de operaciones. Pearson Educación.\n- Jerry Banks, ¿Handbook of Simulation: Principles, Methodology, Advances, Applications and Practice¿, Wiley, 1998.\n- Hillier, F. S., & Lieberman, G. J. (2002). Investigación de operaciones. McGraw-Hill/Interamericana Editores, SA.\n- Winston, W. L., & Goldberg, J. B. (2005). Investigación de operaciones: aplicaciones y algoritmos.\n- Ignizio,J. Linear Programming. Prentice Hall, New Jersey, 5a edición, 1994.\n- http://gfebres.net/Downloads/eCourses/Docs/2012.Taha.InvestigacionDeOperaciones9naEdicion.pdf\n- http://gfebres.net/Downloads/eCourses/Docs/2012.Taha.InvestigacionDeOperaciones9naEdicion.pdf\n- Ross, S. M. (2014). Introduction to probability models. Academic press.\n- Averill  M. Law and W.D. Kelton, Simulation Modelling and Analysis, McGraw-Hill, 2000 (third edition).\n- Geoffrey Gordon, ¿System Simulation¿, Second Edition, PHI, 2006 (Unit ¿ V).\n- Frank L. Severance, ¿System Modeling and Simulation¿, Wiley, 2001.\n- M. Law and W. D. Kelton. Simulation Modeling and Analysis, 3rd Edition, McGrawHill, New York, USA, 1998\n- Kulkarni, V.G.  Introduction to Modeling and Analysis of Stochastic Systems, 2  edición. Springer. 2011.\n- Obaidat, Mohammad S, & Boudriga Noureddine A. Fundamentals of Performance Evaluation of Computer and Telecommunication Systems. 2010. Wiley."
    }
}