{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "32_IntroduccionALaComputacionMovil_34808",
    "description": "Syllabus de la materia 'IntroduccionALaComputacionMovil' con código '34808'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Computación móvil",
        "Nombre Largo de la Asignatura": "Introducción a la computación móvil",
        "Código de la asignatura": "34808",
        "Grado": "Pregrado",
        "Descripción": "El objetivo de esta asignatura es presentar los conocimientos esenciales del diseño e implementación de software para dispositivos móviles, de los conceptos esenciales de diseño de interfaces e interacción con el usuario para este tipo de dispositivos. Adicionalmente, se busca fomentar el desarrollo de habilidades técnicas y de diseño en ingeniería requeridas para implementar una aplicación móvil multiplataforma. El curso está basado en clases magistrales interactivas, talleres prácticos donde los estudiantes implementan aplicaciones para dispositivos móviles y el desarrollo de un proyecto donde los estudiantes deben proponer, diseñar e implementar una solución basada en computación móvil.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisitos de inscripción: Bases de Datos /y/ Comunicaciones y redes /y/ Fundamentos de ingeniería de software /o Para Cs. de Datos/ Comunicaciones y redes /y/ Principios de desarrollo de software",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar las metodologías y herramientas para el desarrollo de soluciones basadas en computación móvil. \nPresentar las plataformas móviles existentes y las herramientas de desarrollo nativas e híbridas disponibles para dichas plataformas.   \nIdentificar estrategias, herramientas y metodologías para la generación de alternativas de solución a problemas de construcción de soluciones móviles. \nBrindar literatura y textos en inglés relacionados con la ingeniería de software.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nComparar nuevas tecnologías para la construcción de software móvil (CDIO 2.1) (Disciplinar 1-2-3) \nProponer una solución basada en dispositivos móviles (CDIO 2.1)(Disciplinar 1-2-3) \nConocer los mecanismos necesarios para el desarrollo de aplicaciones móviles multi-usuario y con acceso a hardware del dispositivo. (CDIO 4.3, 4.4) Disciplinar 1,4) \nBuscar de forma autónoma nuevos conceptos, tecnologías y herramientas para la construcción de una aplicación móvil en una plataforma híbrida. (CDIO 2.4, Disciplinar 5,6) \nAplicar los procedimientos necesarios para construir una aplicación móvil  multiusuario (CDIO 4.5)(Disciplinar 4,5)",
        "Contenidos temáticos": "Introducción a la computación móvil \nDiseño centrado en el usuario \nDesarrollo de aplicaciones nativas para Android \nDesarrollo de aplicaciones nativas para iOS \nConceptos avanzados: Plataformas híbridas, backend, servicios de nube, acceso a hardware",
        "Estrategias Pedagógicas": "El desarrollo del curso se divide en un componente de formación teórico y un componente práctico. A través del componente de formación teórica el estudiante adquirirá las habilidades y conocimientos necesarios para desarrollar aplicaciones usando dispositivos móviles. Cada clase incluye una sección de teoría impartida por el profesor, para luego hacer una práctica en donde a través de talleres se busca que el estudiante de solución a problemas a través de aplicaciones móviles, utilizando las herramientas disponibles. Este componente requiere del estudiante un compromiso en la preparación previa de los temas y la exploración de material bibliográfico como artículos científicos, manuales técnicos, análisis de casos que faciliten el conocimiento en profundidad de lo visto en clase. \n\nTambién se busca que los estudiantes investiguen y apropien conocimientos de otras plataformas y tecnologías recientes no cubiertas en las clases teóricas, a través de talleres prácticos.",
        "Evaluación": "Las estrategias de evaluación están centradas en la valoración de los resultados de aprendizaje esperado de la asignatura; las cuales pueden ser formativas que suscitan la comprensión y construcción de conocimiento, y sumativas que incluyen porcentajes de evaluación con el fin de corroborar el logro de los aprendizajes y el desarrollo de las competencias en los estudiantes.  \n\nLas estrategias de evaluación de la asignatura son: \n\n20% Primer examen teórico-práctico de la materia  \n20% Segundo examen teórico-práctico de la materia  \n30% Proyecto del curso \n8% Propuesta y diseño de interfaces del proyecto   \n10% Diseño y Caso de uso más importante implementado  \n12% Entrega final con todas las funcionalidades del proyecto  \n20% Talleres prácticos  \n10% Quices y actividades en clase",
        "Recursos Bibliográficos": "Principales \nDocumentación para desarrolladores Android: https://developer.android.com \nThe swift programming Language: https://docs.swift.org/swift-book/GuidedTour/GuidedTour.html \n\nDocumentación para desarrolladores Apple:  \nhttps://developer.apple.com/develop/ \n\nDocumentación para desarrollo con Firebase (Backend as a Service) \nhttps://firebase.google.com/docs/ \nInternet Trends 2018:  https://www.kleinerperkins.com/perspectives/internet-trends-report-2018/ \n\nSecundarios \nACM SIGCHI Curricula for Human-Computer Interaction. Hewett, Baecker, Card, Carey, Gasen, Mantei, Perlman, Strong and Verplank \nhttp://old.sigchi.org/cdg/ \nAdaptive Hypermedia and Adaptive Web-Based Systems: 4th International Conference, AH 2006, Dublin, Ireland, June 21-23, 2006, Proceedings (Lecture Notes in Computer Science) by Vincent Wade, Helen Ashman, and Barry Smyth. \nModeling and Using Context: 5th International and Interdisciplinary Conference, CONTEXT 2005, Paris, France, July 5-8, 2005, Proceedings (Lecture Notes ... / Lecture Notes in Artificial Intelligence) by AnindDey, BoichoKokinov, David Leake, and Roy Turner \nLocation- and Context-Awareness: Third International Symposium, LoCA 2007, Oberpfaffenhofen, Germany, September 20-21, 2007, Proceedings (Lecture Notes in Computer Science) by Jeffrey Hightower, BerntSchiele, and Thomas Strang \nUser Modeling 2005: 10th International Conference, UM 2005, Edinburgh, Scotland, UK, July 24-29, 2005, Proceedings (Lecture Notes in Computer Science) by Liliana Ardissono, Paul Brna, and AntonijaMitrovic \nUbiquitous Intelligence and Computing: 4th International Conference, UIC 2007, Hong Kong, China, July 11-13, 2007, Proceedings (Lecture Notes in Computer Science) (Lecture Notes in Computer Science) by Jadwiga Indulska, Jianhua Ma, Laurence T. Yang, and Theo Ungerer \nUbiquitous Computing: 8th International Conference, UbiComp 2006, Orange County, CA, USA, September 17-21, 2006, Proceedings (Lecture Notes in Computer Science) by Paul Dourish and Adrian Friday"
    }
}