{
    "version": "1.0",
    "last_updated": "2024-08-21",
    "title": "33_FeYCompromisoDelIngeniero_2476",
    "description": "Syllabus de la materia 'FeYCompromisoDelIngeniero' con código '2476'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Fe y Compromiso del Ingeniero",
        "Nombre Largo de la Asignatura": "Fe y Compromiso del Ingeniero",
        "Código de la asignatura": "2476",
        "Grado": "Pregrado",
        "Descripción": "La asignatura busca contribuir en la formación de la conciencia crítica y compromiso de los estudiantes de cara a los problemas sociales presentes en la realidad colombiana, como lo recuerda el proyecto educativo javeriano: - la Injusticia y violación de los derechos humanos, la concentración del poder económico, social y político, la irracionalidad en el manejo del medio ambiente y la crisis ética ligada a la crisis de valores. De esta forma, permite la formación integral de los estudiantes javerianos y profundizar sistemáticamente sobre las causas, consecuencias, permanecía de los problemas y las posibles alternativas desde un compromiso que involucre su fe en el ejercicio de la profesión desde la metáfora de encargarse de la realidad. El diálogo propuesto entre fe y compromiso del javeriano favorece una mayor conciencia social. Por ello, la asignatura termina con un ejercicio de responsabilidad social, que a su vez es individual y social.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Req inscrip: ( Plan 3 Ingeniería Civil: Pre: ( Proy infra vial /y/ Proy hidro) /o/ Corr: Proy diseño) /o/ (Ing Indu Plan 2, Ing Sis Plan 2: Proy dis redes /o/ Proy diseño meca /o/ Proy CDIO Año 3 /o/ Proy Inno TI ) /o/ Demás Plan estudio: Sin condiciones",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Favorecer la aproximación interdisciplinar a la realidad social, política, económica, ambiental y del posconflicto.\nFomentar el respeto en la propuesta de una sociedad posible con una visión esperanzadora.\nPresentar la conceptualización básica (desde los valores la moral y la ética) para vivir mejor en una sociedad posible.                                                                          \nValorar las relaciones humanas como aproximación a la responsabilidad social (individual y empresarial). \nReconocer que cada uno puede aportar para lograr una responsabilidad individual social y empresarial.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nIdentifica la realidad, social, política, ambiental, económica y el estado actual del posconflicto. \nRelaciona y diferencia los conceptos básicos (desde los valores, la moral y la ética) para proponer una sociedad posible y esperanzadora.\nIdentifica la fundamentación básica donde cada persona se hace responsable de sí mismo y de los demás. \nElabora una propuesta de responsabilidad individual, social y empresarial.",
        "Contenidos temáticos": "Unidad 1\nAproximación interdisciplinar a la realidad social. VER.\n1. Lectura crítico-teológica de la realidad social.\n1.1 Panorama social.\n1.2 Panorama político.\n1.3 Panorama ambiental.\n1.4 Panorama económico.\n1.5 Una mirada a los problemas de Colombia desde la historia (El posconflicto).\n\nUnidad 2\nConceptualización teológica. JUZGAR. \n2. La sociedad posible: Una visión esperanzadora de la realidad. \n2.1 De la realidad a la posibilidad. \n2.2 Valores cristianos en un mundo que avanza.\n2.3 Relevancia de la moral social en el hoy de la historia.\n2.3.1 Aportación de la fe al compromiso sociopolítico.\n2.3.2 Derechos y dignidad humanos.\n2.3.3   Solidaridad y subsidiariedad.\n\nUnidad 3\nUna mirada hacia el futuro. ACTUAR. \n3. De la ética individual a la ética social.\n3.1 De la Heteronomía a la autonomía.\n3.2 Responsabilidad social.  \n3.2.1 Justicia y reconciliación (Del conflicto hacia la paz).\n3.2.2 Sociedad incluyente.",
        "Estrategias Pedagógicas": "La metodología asumirá una dinámica participativa que llevarán a cabo docente y estudiantes.\nActividades\n-Desarrollo de talleres.\n-Desarrollo de informes de lecturas.\n-Trabajos en grupo.\n- Elaboración de responsabilidad social.",
        "Evaluación": "Criterios de",
        "Recursos Bibliográficos": "Unidad 1\nLos problemas sociales de la sociedad colombiana.\nLa corrupción política en Colombia.\nLa cosa está dura en economía. Revista Semana.\nLos desafíos ambientales de Colombia en el 2019. https://es.mongabay.com/2019/01/colombia-desafios-ambientales-2019/\nEl acuerdo de paz es como un tipití.\n\nUnidad 2\nEl valor de educar. Cap. 1. El aprendizaje humano.\nLa respuesta de Kant a que es la Ilustración.\nÉtica y moral. Suárez y Meza.\nLos Valores. Suárez y Meza.\n\nUnidad 3\nEvangelio de Juan. Antropología.\nhttp://globalizacionydemocracia.udp.cl/wp-content/uploads/2014/03/ADELA_CORTINA_2010.pdf.\nhttp://www.scielo.org.ar/scielo.php?script=sci_arttext&pid=S1853-70812014000200003. Para responsabilidad y doctrina sociales de la Iglesia.\nEntrevista a Adela Cortina.\n\nFuentes de consulta complementarias\nColombia: democracia y paz Seminario in AA.VV. Manual de doctrina social de la Iglesia. Bogotá: CELAM, 1997.\nAA.VV. Repensar a Colombia. Hacia un nuevo contrato social. Bogotá: Tercer mundo, 2002.\nANTONCICH, Ricardo. Temas urgentes de la Doctrina Social. Colección Cristianismo y Sociedad. Bogotá: Paulinas, 1987.\nBUSHNELL, David. Colombia. Una nación a pesar de sí misma. Bogotá: Planeta, 1999, cuarta edición.\nCELAM, Promoción humana y cultura cristiana. CELAM 1992\nDE ROUX FRANCISCO. Colombia una casa para todos. Bogotá: Pontifícia Universidad Javeriana,1990.\nGARCIA, José Luis., Conceptos fundamentales en la Doctrina Social de la Iglesia. Madrid: Centro de Estudios Sociales, 1971.\nGONZ LEZ, Andrés, compilador. Diversidad y dinámicas del cristianismo en América Latina. 1ra. Edición, U. de San Buenaventura, 2007\nLEBACQZ, Karen. Justicia en un mundo injusto: bases para un proyecto cristiano. Barcelona: Herder. 1991.  \nMARITAIN, Jacques. La persona y el Bien Común. Buenos Aires: Club de lectores,1968\nPARRA, Alberto. Fe cristiana y sociedad. Pontificia Universidad Javeriana, Facultad de Teología: Bogotá: Facultad de Teología, 2002."
    }
}