{
    "version": "1.0",
    "last_updated": "2024-08-21",
    "title": "35_IntroduccionInteligenciaArtificial_4084",
    "description": "Syllabus de la materia 'IntroduccionInteligenciaArtificial' con código '4084'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Introducción a IA",
        "Nombre Largo de la Asignatura": "Introducción a la inteligencia artificial",
        "Código de la asignatura": "4084",
        "Grado": "Pregrado",
        "Descripción": "Uno de los grandes retos de la ciencia y la tecnología es hacer que el computador realice tareas que requieren razonamiento, sentido común, manejo del conocimiento o análisis de datos. Por lo tanto, resulta indispensable adquirir herramientas básicas para lograr el diseño e implementación de soluciones basadas en técnicas de la Inteligencia Artificial.\nEn este curso se parte de los conceptos introductorios en cada uno de los temas; no se asumen conocimientos previos. En consecuencia, sirve como base conceptual para otros cursos del área de Sistemas Inteligentes, Robótica y Percepción.\nLa metodología de aprendizaje se basa en el desarrollo de talleres y proyectos prácticos que permiten apropiar el uso de estas tecnologías y comprender el fundamento conceptual que las soporta.\nEl estudio de los sistemas inteligentes abre grandes áreas de desarrollo e investigación con importante proyección hacia el futuro. En efecto ya hoy en día todo sistema informático debería incluir IA.",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisitos de inscripción: Estructuras de Datos",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "- Brindar herramientas en las diferentes áreas que involucra la inteligencia artificial para el desarrollo de soluciones a problemas prácticos mediante sistemas basados en conocimiento y análisis de datos.\n- Aplicar la inteligencia artificial y el paradigma de programación declarativo como medio para desarrollar la capacidad de abstracción y las habilidades para solución de problemas.\n- Generar discusiones y reflexiones que desarrollen conciencia del impacto, tanto positivo como negativo, del uso de la inteligencia artificial en la sociedad y de sus implicaciones éticas.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nRAE-1: Explicar los principios y técnicas básicas de la inteligencia artificial con el fin poder resolver problemas aplicables en su ejercicio profesional (CDIO 2.1 y Disciplinar Todas). \nRAE-2: Aplicar, a través de la implementación de programas, los conceptos de representación de conocimiento e inferencia utilizando el modelo de programación lógica, y las técnicas básicas de aprendizaje de máquina (CDIO 2.1 y Disciplinar 2). \nRAE-3: Validar hipótesis mediante el diseño de experimentos orientados a evaluar la implementación de soluciones basadas en el uso de técnicas básicas de aprendizaje de máquina (CDIO 2.2 y Disciplinar 5). \nRAE-4: Discutir sobre su responsabilidad ética y social al utilizar la tecnología en el entorno real mediante una reflexión crítica de la aplicación de la inteligencia artificial (CDIO 2.5 y Disciplinar 1). \nRAE-5: Fomentar su proceso de auto aprendizaje y aplicación del conocimiento a partir de las habilidades de abstracción y deducción en el análisis y solución de problemas usando la inteligencia artificial (CDIO 2.4 y Disciplinar Todas).",
        "Contenidos temáticos": "1.\tConceptos Básicos de IA\n2.\tRepresentación del Conocimiento\n3.\tSolución de Problemas con IA\n4.\tSistemas Basados en Reglas\n5.\tAprendizaje de Máquina",
        "Estrategias Pedagógicas": "Las estrategias de evaluación están centradas en la valoración de los resultados de aprendizaje esperado de la asignatura; las cuales pueden ser formativas que suscitan la comprensión y construcción de conocimiento. Durante el curso se utilizarán 4 estrategias:\n1 - Aprendizaje Directivo: se realizará la presentación de los temas acompañadas de ejercicios y ejemplos demostrativos en clase con participación activa de los estudiantes.\n2 - Aprendizaje basado en Problemas: se reforzará la comprensión de los conceptos y su aplicación práctica mediante talleres desarrollados en grupo, donde se solucionan problemas de complejidad sencilla; el trabajo en colaborativo incentiva el intercambio y la construcción conjunta de conocimiento entre los estudiantes.\n3 - Aprendizaje por Proyectos: se propone la elaboración de una solución que responda a un problema acotado; permite la aplicación de conocimientos en un problema inspirado del mundo real para reforzar el aprendizaje significativo, la reflexión sobre el uso práctico y responsable de la IA, y la aplicación de métodos de diseño experimental y validación de hipótesis.\n4 - Autoaprendizaje: se realizará una exposición para profundizar sobre una temática del curso, promoviendo de esta forma las habilidades de aprendizaje autónomo, trabajo colaborativo y comunicación oral/visual.\n\nEl desarrollo de las actividades ligadas a estas estrategias se apoyará principalmente en el uso de la plataforma Campus Virtual.",
        "Evaluación": "En este curso no se realizan exámenes parciales ni examen final. En lugar de estos, a lo largo del curso se realizan quices en la mayoría de las clases que permiten evaluar en forma individual el nivel de aprendizaje adquirido por los estudiantes; además de la evaluación individual, los quices pretenden motivar una continuidad del trabajo de la clase. \n\nEl curso se organiza en 5 módulos, la evaluación de estos dependerá principalmente de las tareas de autoaprendizaje, los ejercicios de resolución de problemas, las exposiciones y los quices. La principal componente transversal de la evaluación la constituyen los proyectos de apropiación práctica. \n\nLos porcentajes asignados a cada una de las modalidades de evaluación son: \n\nExposición ML                      10%\nProyectos\n     Proyectos 1-2-3 3x8%    24%\n     Proyecto ML                        8%\n     Experimento ML                 8%\nTalleres y tareas\n     Talleres temas de clase 12%\n     Taller Ética y Sociedad      8%\nQuices                                      30% \n\nNota: La nota de los proyectos y talleres depende de la sustentación del trabajo entregado que realicen los estudiantes. Si bien, éstos se realizan en grupo, no necesariamente la nota asignada es la misma para cada miembro del grupo.",
        "Recursos Bibliográficos": "1.\tRusell N., Inteligencia Artificial: Un Enfoque Moderno, Prentice Hall, 2004.\n2.\tFerber J., MultiAgent Systems: an Introduction to Distributed Artificial intelligence, Addison Wesley, 1999.\n3.\tKlir G.J., Fuzzy Sets and Fuzzy Logic: Theory and Applications, Prentice Hall, 1995.\n4.\tDumitrescu D., Evolutionary Computation, CRC Press, 2000.\n5.\tHam F.M., Principles of Neurocomputing for Science & Engineering, McGraw Hill, 2001.\n6.\tMitchel T.M., Machine Learning, McGraw Hill, 1997.\n7.\tMinsky M., The Society of Mind, Touchstone Book, 1986.\n8.\tCopeland J., Inteligencia Artificial: una Introducción Filosófica, Alianza, 1996.\n9.\tBoden M.A., Filosofía de la Inteligencia Artificial, Fondo de Cultura Económica de Méjico, 1984 y 1994.\n10.\tHaugeland J., La Inteligencia Artificial, Editores Siglo XXI, 1988.\n11.\tHopgood A., Intelligent Systems for Engineers and Scientists, CRC Press, 2001.\n12.\tRich N., Inteligencia Artificial, McGraw Hill, 1998.\n13.\tGonzález E., Bustacara C., Desarrollo de Aplicaciones Basadas en Sistemas MultiAgentes, 1era Edición, Editorial PUJ, 2007.\n14.\tGonzález E., Robótica Cooperativa, 1era Edición, Editorial PUJ, 2012.\n15.\tWooldridge M., Introduction to MutiAgent Systems, Wiley, 2002.\n16.\tWeiss G., MultiAgent Systems: a Modern Approach to Distributed Artificial Intelligence, MIT Press, 2001.\n17.\tHuhns M., Readings in Agents, Morgan Kaufmann, 1998.\n18.\tMurch R., Intelligent Software Agents, Prentice Hall, 1998.\n19.\tNguyen H.T., A First Course in Fuzzy Logic, Chapman & Hall, 1999.\n20.\tPassino K.M., Fuzzy Control, Addison-Wesley, 1998.\n21.\tLi H.X.., Fuzzy Neural Intelligent Systems: Mathematical Foundation and the Applications in Engineering, CRC Press, 2001.\n22.\tFogel L.J., Intelligence Through Simulated Evolution, Wiley, 1999.\n23.\tFalkenauer E., Genetic Algorithms and Grouping Problems, Wiley, 1998.\n24.\tGoldberg D., Genetic Algorithms in Search Optimization and Machine Learning, Addison-Wesley, 1989.\n25.\tHagan M., Neural Network Design, PWS, 1996.\n26.\tHaykin S., Neural Networks: a Comprehensive Foundation, Prentice Hall, 1994.\n27.\tFreeman J., Redes Neuronales: Algoritmos, Aplicaciones y Técnicas de Programación, Addison-Wesley, 1993.\n28.\tKosko B., Neural Networks and Fuzzy Systems: a Dynamical Systems Approach to Machine Intelligence, Prentice Hall, 1992.\n29.\tHanson S.J., Computational Learning Theory and Natural Learning Systems, Mit Press, 1994.\n30.\tWinston P., Artificial Intelligence, Addison Wesley, 1992.\n31.\tMartín del Río B., Redes Neuronales y Sistemas Difusos, Alfa Omega, 2002.\n32.\tDean T., Artificial Intelligence: Theory and Practice, The Benjamin Cummings Publishing Company, 1995.\n33.\tBarr P.R., The Handbook of Artificial Intelligence, Kaufmann, 1989.\n34.\tGinsberg M., Essentials of Artificial Intelligence, Morgan Kaufmann, 1993.\n35.\tLuger G.F., Artificial Intelligence: Structure and Strategies for Complex Problem Solving, Benjamin Cummings Publishing, 1993.\n36.\tBigus J., Constructing Intelligent Agents Using Java, Wiley, 2001.\n37.\tBratko I., Prolog Programming for Artificial Intelligence, Addison-Wesley, 1990."
    }
}