{
    "version": "1.0",
    "last_updated": "2024-08-21",
    "title": "38_ProyectoSocialUniversitario_5100",
    "description": "Syllabus de la materia 'ProyectoSocialUniversitario' con código '5100'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Proyecto social universitario",
        "Nombre Largo de la Asignatura": "Proyecto Social Universitario de Ingeniería de Sistemas",
        "Código de la asignatura": "5100",
        "Grado": "Pregrado",
        "Descripción": "El Proyecto Social Universitario (PSU) es una asignatura creada bajo los principios de formación integral del Proyecto Educativo de la Pontificia Universidad Javeriana. La cual busca generar en el ingeniero javeriano una actitud de reflexión y cambio, a través de la aplicación de sus conocimientos en actividades de capacitación y/o asesoría técnica, que contribuyan a la transformación del contexto en el que realiza su práctica social. Por medio de visitas a territorio y la participación en foros y paneles de discusión.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Req insc: //Fund de Ing sw/ o /Ing Sw/ y Ges Proy I y E/ o / Eval proys/ y /Sig Teol/ o / 2 Cr Teol// O Ing Sis (antiguo p) //Comun y r/ y /Ges Proy I y E/ o / Eval proy/ y /Pens sis/ y /Sis inf/ y /S O/ y /BD/ y /Epist ing/o/ 2 Cr F//",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Ofrecer a los estudiantes un espacio de formación integral ignaciana que articule la relación del ejercicio profesional de la ingeniería con los retos sociales del país. \nBrindar al estudiante una experiencia de servicio que le permita comprender el impacto y la responsabilidad, que en su actuar como ingeniero, puede llegar a tener dentro del proceso de transformación social.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar la asignatura el estudiante estará en capacidad de:  \nRelacionar el contexto social y ambiental con su ejercicio profesional (Disciplinar 1) (CDIO 4.1). \nAplicar la experiencia profesional y los conocimientos disciplinarios aprendidos en Ingeniería de Sistemas para identificar problemas y proponer soluciones a las necesidades de entidades y/o comunidades vulnerables (Disciplinar 2) (CDIO 2.1). \nAplicar habilidades personales, importantes para el ejercicio de la profesión, en respuesta a necesidades y requerimientos de entidades o comunidades (Disciplinar 1,2) (CDIO 2.4). \nIdentificar los retos éticos, profesionales y de equidad que debe asumir dentro en el ejercicio profesional (Disciplinar 4) (CDIO 2.5). \nParticipar de manera responsable y comprometida con el equipo académico y comunitario de un proyecto social,  aportando al logro de los objetivos propuestos (Disciplinar 5) (CDIO 2.5 y CDIO 3.1)",
        "Contenidos temáticos": "Identificación de ideas y oportunidades de acción con base en las necesidades y requerimientos de las entidades y/o comunidades vulnerables. \n\nEstructuración de proyectos de asesoría técnica y/o capacitación que den respuesta a las necesidades y requerimientos de la comunidad con base en los recursos disponibles, utilizando los conocimientos de ingeniería de sistemas.",
        "Estrategias Pedagógicas": "Las actividades de clase están centradas en desarrollar habilidades que permitan al estudiante aplicar sus conocimientos en ingeniería en problemáticas de una comunidad, identificando características del contexto, necesidades del territorio y oportunidades de acción. Para esto se realizarán salidas de campo y visitas a territorio, así como foros de discusión y paneles de experiencia. Realizando reflexiones en torno a las temáticas abordadas y a las experiencias obtenidas en campo.",
        "Evaluación": "Las estrategias de evaluación están centradas en la valoración de los resultados de aprendizaje esperado de la asignatura; las cuales pueden ser formativas que suscitan la comprensión y construcción de conocimiento,¿y sumativas que incluyen¿porcentajes de evaluación con el fin de corroborar el logro de los aprendizajes y el desarrollo de las competencias en los estudiantes. Las estrategias de evaluación de la asignatura son: \n\nAnálisis de Contexto y estructuración del proyecto 20% (Documento de contexto) \nAsistencia a la entidad                                                     5 % \nCumplimiento de los objetivos del proyecto              20% (en conjunto con el interlocutor) \nInformes parciales de entregables realizados            25% (de acuerdo a la planeación realizada) \nPresentación e Informe final:                                         10% \nAsistencia a clase, reuniones y talleres                         20%",
        "Recursos Bibliográficos": "Bibliografía de acuerdo al tipo de proyecto."
    }
}