{
    "version": "1.0",
    "last_updated": "2024-08-21",
    "title": "39_EticaEnLaEraDeLaInformacion_34863",
    "description": "Syllabus de la materia 'EticaEnLaEraDeLaInformacion' con código '34863'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Ética era de la información",
        "Nombre Largo de la Asignatura": "Ética era de la información",
        "Código de la asignatura": "34863",
        "Grado": "Pregrado",
        "Descripción": "En este curso se adopta la posición de que la información y la tecnología que la conduce hasta nosotros no es ni un medio neutro ni es un hecho aislado, sino que tiene tanto consecuencias como impulsos provenientes de complejas interacciones sociales, económicas y políticas. La motivación del curso es la necesidad de pensar y entender el presente desde el punto de vista del impacto de la era de la información en nuestra vida social e individual. Desde que los teléfonos se desconectaron y se volvieron poderosos procesadores de información, incorporamos aparatos que nos prometen un acceso veloz y fluido a diversos ámbitos cotidianos. La interacción social, la compra de bienes de consumo, la gestión de servicios o, sencillamente, la consulta de información general, se nos ofrecen como promesas de experiencias de intensidad y calidad variable. En los flujos de contenido de cualquier dominio web, tenemos acceso a aquello que algoritmos invisibles deciden mostrar con base en nuestros movimientos anteriores.\nSi el gesto cotidiano que media en nuestra interacción con el mundo virtual ha pasado a ser casi automático, y tan familiar y común que apenas los notamos en su transparencia, no pasa lo mismo con el impacto que esta dimensión digital tiene en las sociedades humanas y las profundas transformaciones que se producen por causa de esta. Así, el curso adopta la doble perspectiva de interpretar la información y la tecnología tanto desde el individuo como desde la sociedad, la economía y la política.\nEl curso se desarrolla por medio de clases magistrales interactivas, estudios de caso y talleres grupales.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Sin condiciones",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "1. Promover la comprensión del contexto histórico y político de la era de la información.\n2. Reflexionar colectivamente sobre las posturas y posibilidades de acción del sujeto actual mediante análisis de casos.\n3. Orientar la problematización de las dinámicas sociales, culturales y políticas asentadas en el uso de las últimas tecnologías de comunicación.\n4. Facilitar la tomar de una postura crítica y reflexiva ante los procesos y sucesos examinados.\n5. Contribuir a entender que los procesos tecnológicos no son aislados ni un exclusivo problema técnico",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en la capacidad de:\nAnalizar el contexto en el que el estudiante se encuentra involucrado a través del uso de las tecnologías de la información\nIdentificar problemas éticos de la era de la información\nDiscutir las características del problema y sus implicaciones éticas\nDefender sus interpretaciones y perspectivas con argumentos razonable\nAplicar en casos concretos diversas propuestas teóricas considerando sus alcances y perspectivas\nComparar las herramientas metodológicas y conceptuales básicas de la era de la información\n\n Nota: Para cada RAE aplica todas las competencias disciplinares y todas las no disciplinares declaradas en los puntos anteriores.",
        "Contenidos temáticos": "1. ¿Qué es la era de la información?\n2. El espacio virtual\n3. Big data, nuevas economías, nuevas morales.\n4. La virtualización del cuerpo y del intelecto\n5. Implicaciones sociales y económicas de una sociedad digital\n6. Impacto en el individuo contemporáneo y sus formas de relacionarse con su comunidad y las instituciones\n7. Interacción con otras problemáticas globales como el calentamiento global, la posverdad o la radicalización política.",
        "Estrategias Pedagógicas": "La cátedra se desarrolla mediante clases magistrales interactivas, en las que el profesor orienta el examen de diversas temáticas, invitando a los estudiantes a plantear tanto sus propuestas de interpretación como sus inquietudes. El profesor suscitará un diálogo permanente, buscando analizar los asuntos teóricos y conceptuales en compañía de los estudiantes. Para cada clase los estudiantes deberán realizar la lectura de un texto, en algunos casos se tratará de una película para ver antes de clase, y que servirá como punto de partida para realizar un acercamiento conceptual a un asunto que le concierne de forma práctica y concreta. La clase se complementará con ejercicios y talleres grupales.",
        "Evaluación": "Las estrategias de evaluación consisten en diversos métodos que facilitan valorar el aprendizaje del estudiante. Sin embargo, también buscan permitirle al estudiante ganar claridad sobre sus avances en sus procesos de interpretación y argumentación. El objetivo de formación es apoyar los procesos de aprendizaje, el desarrollo permanente de las capacidades de analizar, discutir, evaluar y criticar las temáticas y desarrollos teóricos del curso. \nLa evaluación sumativa tendrá la siguiente distribución: \nPrimera evaluación parcial (30%). Trabajos y actividades de la primera parte del semestre.\nSegunda evaluación parcial (30%). Trabajos y actividades de la segunda parte del semestre.\nTercera evaluación (40%): Trabajo o examen final y actividades adicionales de la tercera parte del semestre.\n\nNota: El cronograma de actividades y trabajos aparecerá en el plan de la asignatura que se entregará al comienzo del semestre.",
        "Recursos Bibliográficos": "- Baudrillard, J. (1979). Crítica de la economía política del signo. México: Siglo Veintiuno. \n- Buzai, G. M. (2014). Fronteras en el ciberespacio: el nuevo mapa mundial visto desde Buenos Aires (Argentina). Cuadernos de Geografía. Revista colombiana de geografía. 23 (2), 85-92. http://dx.doi.org/10.15446/rcdg.v23n2.38088. \n- Deleuze, Gilles: ¿Posdata sobre las sociedades de control¿, en Christian Ferrer (comp), El lenguaje libertario. Altamira, Buenos Aires, 1999.\n- Esquirol, J., Los filósofos contemporáneos y la técnica, Madrid: Gedisa, 2011.\n- Eriksson, K. (2007). Networks and the philosophy of noise. Culture and Organization, 14 (No. 3), 279-292. doi: 10.1080/14759550802270700. \n- Gabriel, M., Yo no soy mi cerebro: filosofía de la mente para el siglo XXI, Barcelona, España : Pasado y presente, 2016.\n- Habermas, J. El futuro de la naturaleza humana. ¿Hacia una eugenesia liberal? Barcelona, Paidós, 2002\n- Han, B.-CH., Psicopolítica, Barcelona: Herder 2012.\n- Hartnett, K (2016, 23 de noviembre). How to Force Our Machines to Play Fair. Quanta Magazine. Recuperado de https://www.quantamagazine.org/20161123-privacy-and- fairness-an-interview-with-cynthia-dwork/ \n- Jonas, H., ¿Homo pictor and the differentia of man¿, Social research, Vol. 29, no. 2 (summer 1962), pp. 201-220.\n- Lévy, P. (1998). ¿Qué es lo virtual? Barcelona: Paidós. \n- Lévy, P. (2012). La mutation inachevée de la sph re publique. Signo y Pensamiento, 31 (60), 96-103. Recuperado de http://www.scielo.org.co/scielo.php?script=sci_abstract&pid=S0120-48232012000100008 \n- Moreno, J. (2013). Virtualidad, estética y técnica: de la máscara antigás a la invención de una nueva sensibilidad. Trilogía. Ciencia, Tecnología y Sociedad, 10, 39-51. \n- Mumford, L. (2010) El mito de la máquina, Larioja: ed. Pepitas de Calabaza, 2010.\n- Piketty, Th., El capital en el siglo XXI, Bogotá : Ediciones Fondo de Cultura Económica, 2014.\n- Serres, M. (1995) Atlas. Madrid: Cátedra.\n- Serres, M. (diciembre, 2007b). Les nouvelles technologies: révolution culturelle et cognitive. Conferencia llevada a cabo en el Forum pour les 40 ans de l¿INRIA, Lille, Francia. Recuperado de http://www.acgrenoble.fr/ien.bourgoinashnord/IMG/pdf_Texte_de_la_conferenc \n- Serres, M. (2013). Pulgarcita. El mundo cambió tanto que los jóvenes deben reinventar todo: una manera de vivir juntos, instituciones, una manera de ser y de conocer... Buenos Aires: Fondo de Cultura Económica. \n- Serres, M. (2015) Figuras del pensamiento: autobiografía de un zurdo cojo. Barcelona: Gedisa. (Versión para Kindle). Recuperado en www.amazon.com. \n- Watts, D. J. (2003). Six Degress: The Science of a Connected Age. London: Random House. \n- Whitaker, R. (1999). El fin de la privacidad. Barcelona: Paidós.\n- Zuboff, S., ¿Big Other: Surveillance Capitalism and the Prospectsof an Information Civilization¿, Journal of Information Technology (2015) 30, 75-89.\n- Zuboff, S., The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power, PublicAffairs, 2019."
    }
}