{
    "version": "1.0",
    "last_updated": "2024-08-21",
    "title": "41_ProyectoDeGrado_34814",
    "description": "Syllabus de la materia 'ProyectoDeGrado' con código '34814'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Proyecto de grado Sistemas",
        "Nombre Largo de la Asignatura": "Proyecto de grado Ingeniería de Sistemas",
        "Código de la asignatura": "34814",
        "Grado": "Pregrado",
        "Descripción": "En esta asignatura los estudiantes aplicarán los conocimientos adquiridos durante toda la carrera en un proyecto de Diseño. Los proyectos podrán ser propuestos por entidades dentro de la Universidad, por grupos de investigación, por la industria o el gobierno, o ser ideas de los propios estudiantes. Las propuestas de proyectos serán válidas siempre que los estudiantes apliquen el proceso de diseño de ingeniería: la definición de requisitos funcionales, conceptualización, análisis, diseño, identificación de riesgos, creación de prototipos y desarrollo de pruebas. El proyecto debe tener restricciones reales y para su desarrollo deben usar estándares de la profesión",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Req ins: Ing Sis (nuevo p) //Plan Proy. Final/ y /Proyecto de Innov y Emprend/ y /Correq -Prereq Arquitectura de Sw// O Ing Sis (antiguo p) //Planeación Proy. Final/ y // Correq - Prereq Arquitectura de Sw// Y //Correq -Prereq Intro. Sistemas Distrib//",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Promover la aplicación de los conocimientos adquiridos durante la carrera, ya sea desde un punto de vista práctico o investigativo, a través de un proyecto empleando una metodología rigurosa.  \nProducir resultados tangibles del proceso realizado.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nProponer una solución al problema planteado durante Planeación de Proyecto Final, utilizando los conceptos esenciales de la ingeniería de sistemas (3) (CDIO 2.1) \nComunicar, a través de un documento técnico, el resultado de su trabajo, argumentando sus decisiones (3) (CDIO 3.2) \nComunicar en una presentación oral el resultado de su trabajo, sustentando sus decisiones frente a un jurado evaluador (3) (CDIO 3.2) \nUtilizar elementos de comunicación asertiva para manejar situaciones de controversia ante la discusión de una idea (3) (CDIO 3.2) \nEscribir un documento técnico en inglés, relacionado con los resultados del proyecto. (3) (CDIO 3.3) \nDiseñar una solución basada en herramientas de ingeniería de sistemas que permita resolver la problemática del proyecto (3) (CDIO 4.4) \nAplicar los procedimientos necesarios para evaluar la calidad del diseño propuesto (3) (CDIO 4.4) \nAplicar los conocimientos y los modos de pensamiento para el diseño de soluciones informáticas (3) (CDIO 4.4) \nGestionar factores asociados a la implementación de la solución propuesta tales como: talento humano, tiempos, costos, desempeño y calidad. (3) (CDIO 4.5) \nImplementar una solución basada en el diseño propuesto (3) (CDIO 4.5) \nAplicar herramientas de apoyo al desarrollo de ambientes de trabajo que propician el pensamiento creativo y la innovación, en un problema u oportunidad específica (3) (CDIO 4.7)",
        "Contenidos temáticos": "Según las necesidades de cada proyecto",
        "Estrategias Pedagógicas": "La asignatura sigue la metodología PBL, Project based learning en la que se pretende que los estudiantes, repartidos en grupos semi-autónomos, desarrollen por sí mismos, diversas competencias al enfrentarse a un problema bajo un contexto real. En particular, cada grupo tendrá un profesor en figura de director, quien, a partir de reuniones semanales, guiará la ejecución del proyecto de diseño. El director será el encargado de: demostrar la importancia de la rigurosidad en la ejecución de un proyecto de ingeniería, apoyar de forma metodológica y técnica la ejecución del proyecto de diseño, dirigir las discusiones del grupo de estudiantes y orientar su aprendizaje autónomo, realizar sugerencias sobre la forma de escribir un documento técnico de ingeniería",
        "Evaluación": "Las estrategias de evaluación de la asignatura se centran en los resultados presentados del proyecto y parte está evaluado por el director del proyecto y parte por un jurado externo durante la sustentación:",
        "Recursos Bibliográficos": "Bourque, Pierre, and Richard E. Fairley. Guide to the software engineering body of knowledge (SWEBOK (R)): Version 3.0. IEEE Computer Society Press, 2014.\nSoftware Architecture in Practice, Third Edition.2013. Len Bass, Paul Clements, Rick Kazman. disponible en Biblioteca General.\nSchmidt, Michael E. Implementing the IEEE software engineering standards. Sams, 2000.\nPMI. Project Management Body of Knowledge (PMBOK Guide). 5th Edition. 2013.\nTamayo, M. (2004). El proceso de la investigación científica. Editorial Limusa."
    }
}