{
    "version": "1.0",
    "last_updated": "2024-08-21",
    "title": "42_GerenciaEstrategicaDeTI_34804",
    "description": "Syllabus de la materia 'GerenciaEstrategicaDeTI' con código '34804'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Gerencia estratégica de TI",
        "Nombre Largo de la Asignatura": "Gerencia estratégica de tecnologías de la información",
        "Código de la asignatura": "34804",
        "Grado": "Pregrado",
        "Descripción": "Esta asignatura aborda el concepto de estrategia, asociándolo al rol que desempeñan las Tecnologías de la Información (TI) en las organizaciones. Igualmente atiende los conceptos de gobierno de TI y alineación estratégica, especialmente aquella que debe existir entre estrategia de TI, Estrategia de Negocio y Estrategia Organizacional, y cómo, esa alineación debe irradiarse a todas las áreas y/o departamentos de la organización. Dado el alcance e importancia de las TI para las organizaciones, al finalizar el curso el estudiante estará en capacidad de aplicar modelos que le permitan analizar el entorno y el impacto que tienen las TI frente a la productividad y competitividad de las organizaciones. La asignatura combina las clases magistrales con el trabajo en equipo y talleres asociados a proyectos específicos desarrollables a lo largo del semestre.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Requisitos de inscripción: Proyecto de Innovación en TI /o/ ( (",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar marcos de referencia que permitan el análisis del entorno en sus tres dimensiones básicas (macro, meso y micro), como instrumentos metodológicos para abordar el diagnóstico estratégico de las organizaciones. \nBrindar herramientas para desarrollar una apropiada gestión estratégica de las tecnologías de la información (TI) en las organizaciones. \nIdentificar problemas propios del direccionamiento estratégico de TI (tecnologías de la información) en las organizaciones para desarrollar habilidades de pensamiento estratégico. \nBrindar herramientas para el diseño, planificación, y alineación de las estrategias corporativas, de negocio, y de TI, aplicables a la solución de problemas propios de la gestión en las organizaciones. \nPlantear los marcos de referencia más utilizados que apoyan el desarrollo de una mejor gestión y gobernanza de TI en las organizaciones.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nPlanificar la estrategia de TI de la organización, basándose en la forma como las TI potencian el desarrollo empresarial, industrial y de negocio (CDIO 4.1, 4.2) (disciplinares 1, 3, 4, 5) \nAdquirir herramientas de trabajo en equipo que le permita a cada estudiante colaborar con sus compañeros en tareas propias de la gestión y también para realizar el análisis de entorno orientado a identificar oportunidades de mejoramiento en la organización (CDIO, 3.1) (disciplinar 1, 5) \nExhibir buenas prácticas en la gobernanza de TI para la gestión de servicios (CDIO, 4.6) (disciplinar 6.) \nUtilizar elementos de comunicación asertiva para transmitir las formas en las que las tecnologías de información afectan los elementos del contexto social y ambiental, en el campo empresarial y de negocios (CDIO, 3.2, 4.1) (disciplinar 2 y 4)",
        "Contenidos temáticos": "Principios básicos de economía (macro, micro) \nAnálisis del entorno  \nNociones de estrategia \nAlineación estratégica de TI, Organizacional, y de Negocio \nPlaneación Estratégica de TI \nGobernanza de TI",
        "Estrategias Pedagógicas": "Se trabaja una metodología mixta entre clases magistrales  interactivas, seminarios-talleres, proyectos, análisis de casos y solución de problemas. Los estudiantes preparan temas de clase pre-asignados para que sean puestos en común ante el curso. \n\n1. Aprendizaje Directivo Mediado (Clases magistrales) \n2. Aprendizaje Colaborativo (Trabajo en equipo) \n4. Exposiciones para Fomentar la profundización y la Investigación \n5. Talleres basados en problemas y estudios de caso. \n6. Conocimiento de las mejores prácticas del mercado.",
        "Evaluación": "de proyectos /o/ Gestión de innovación en TI) /y/ Sistemas de Información )",
        "Recursos Bibliográficos": "Recursos básicos: \nMaholic (2019), IT Strategy, A 3-Dimensional Framework to Plan Your Digital Transformation and Deliver Value to Your Enterprise (libro guía). \nThompson, Peteraf, Gamble, Strickland (2012), Administración Estratégica, 18a edición, MacGrawHill. \nSaunders, Galletta, Perlson (2016), Managing &Using Information Systems: A Strategig Approach, 6Th Edition. University of Massachusetts Amherst. \nTurban, Pollard, Wood (2018) , Information Technology For Management, On-demand Strategies for Performance, Growth and Sustainability, 11Th Edition, Wiley. \nJohnson, Gerry;  y  Scholes, Kevan. (2006). Dirección Estratégica. 7 . Edición. Pearson, Prentice Hall. Madrid. \nHitt, Ireland y Hoskinsson, (2008), Administración estratégica. Competitividad y conceptos de globalización, 7 . Edición, Thomson Editores, México. Texto de Apoyo.\n\nRecursos complementarios: \nLaloux, F. (2015), Reinventar las Organizaciones, arpa ediciones. \nDemil, B., Lecocq, X., Warnnier, V. (2013), Satratégie et Business Models, Master Pearson. \nLuftman, J. (2001), la competencia en la era de la información, Oxford. \nDavid, Fred. (2003). Conceptos de Administración estratégica. 9 . Edición. Pearson, Prentice Hall. Texto de Apoyo. \nHill, Charles, Jones Gareth (2005), Administración estratégica un enfoque integrado. 6 . Edición, MacGrawHill. México. Texto de Apoyo. \nOrtiz, Efrain, Nagles Nofal. (2013). Gestión de tecnología e Innovación, teoría, proceso y práctica. EAN, Bogotá. Segunda Edición, Texto de Apoyo. \nWheelen, Thomas & Hunger, J. David (2006). Administración Estratégica y Política de Negocios, Pearson Prentice Hall, Décima Edición. \nBeltrán Jaramillo J. M. (1999) Indicadores de Gestión. Herramientas para lograr la competitividad. 3R Editores, Segunda Edición. Bogotá. \nBYGRAVE, William. The Portable MBA in Entrepreneurship. Wiley, 1997. \nCHESBROUGH, Henry (2006). Open Innovation. HBSP. NY.\nDrucker, P. (1995), ¿La Sociedad Post-Capitalista¿, Norma, Bogotá, Cap. 1. \nDussauge, Pierre; Hart, Stuart y Ramanantsoa, Bernard (1992), Strategic Technology Management, John Wiley & Sons, Chichester. \nEARL, Michael. Management Strategies for Information Technology. Prentice Hall, 1989. \nEscorsa Pere y Valls Jaume (1997), Manual de gestión e innovación tecnológica en la empresa, CINDA ¿ AECI, Santiago  \nEVANS, Wursters Strategy and the new economics of information. Harvard Business Review. Septiembre-Octubre 1997. \nHAMEL G. y Breen B. (2008) El Futuro de la administración, Grupo Editorial Norma, Harvard Business School Press. Bogotá. \nNonaka Ikujiro and Takeuchi Hirotaka (1994), La organización creadora de conocimiento, Oxford, México. \nTidd Joe, Bessant John y Pavitt Keith (1997), Management Innovation, John Wiley & Soons, Chichester ¿ New York. \nPorter Michael (1987), Competitive Advantage. Creating and Sustaining Superior Perfomance. Macmillan Free Press."
    }
}