{
    "version": "1.0",
    "last_updated": "2024-08-21",
    "title": "43_ConstitucionYDerechoCivil_16143",
    "description": "Syllabus de la materia 'ConstitucionYDerechoCivil' con código '16143'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Constitución y Derecho Civil",
        "Nombre Largo de la Asignatura": "Constitución y Legislación para ingenieros",
        "Código de la asignatura": "16143",
        "Grado": "Pregrado",
        "Descripción": "Este programa tiene como propósito presentar los temas básicos de derecho constitucional basándose en la Constitución Política de 1991 y sus reformas  y  aspectos generales en materia legislativa, en áreas tales como derecho civil y especialidades del mismo como son el régimen de las obligaciones. Se hará énfasis especial en materias tales como nuevas tecnologías y derechos de autor, que de alguna manera complementan la formación legal que un ingeniero de sistemas debe tener como base para la comprensión del derecho como complemento a su carrera y formación.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Sin condiciones",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "- Introducir a los estudiantes en el entendimiento de la dogmática de los derechos fundamentales y de la  estructura orgánica del Estado colombiano.\n- Lograr que el estudiante maneje un lenguaje básico del Derecho Constitucional Colombiano.\n- Lograr que el estudiante entienda el concepto de la Constitución norma de normas, de la supremacía de la Constitución y de la manera de garantizarla.\n- Lograr que el estudiante desarrolle competencias para entender los procesos políticos y los cambios constitucionales.\n- Desarrollar habilidades de lectura de temas constitucionales a nivel de revistas de opinión y     universitarias sobre estos temas.\n- Lograr que el estudiante maneje un lenguaje básico del Derecho Civil.\n- Lograr que el estudiante maneje el tema de contratación en nuevas tecnologías.\n- Introducir en el estudiante el entendimiento del tema de propiedad intelectual",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nSe espera que el estudiante adquiera las competencias Cognitivas,  comunicativas, axiológicas, interpretativas y argumentativas de del Derecho Constitucional Colombiano\nEstará en capacidad de identificar el concepto de la Constitución norma de normas, de la supremacía de la Constitución y de la manera de garantizarla\nReconocer los procesos políticos y los cambios constitucionales.",
        "Contenidos temáticos": "1. Los principios fundamentales en la Constitución de 1991.\n2. Los llamados derechos de segunda generación:\n3.  Los llamados derechos de tercera generación: \n4.  La protección efectiva de los derechos:\n5. Otras acciones para la protección de derechos:\n6. Los elementos poblacionales y territoriales del Estado colombiano.\n7. La estructura del Estado colombiano.\n8. Ramas del Poder Público.\n9. Los organismos de control.\n10.  La descentralización territorial.\n11.  La economía y la hacienda pública.\n12. El contrato.\n13. Contratación de nuevas tecnologías.\n16. Propiedad intelectual.",
        "Estrategias Pedagógicas": "Se combinan exposiciones magistrales como cátedra activa, talleres y videos que reflejen debates reales sobre temas constitucionales y en especialidades del derecho civil, como lo son el régimen de los contratos, propiedad intelectual y la contratación de nuevas tecnologías.",
        "Evaluación": "Talleres 20%\nParcial  25%\nFinal 30%\nOtros 25%",
        "Recursos Bibliográficos": "- Constitución Política de Colombia (Debe ser leída en su totalidad en los primeros quince días del  programa. Sobre su comprensión de lectura se hará un control con un examen de 100 preguntas de escogencia múltiple).\n- Derecho Constitucional Colombiano, Pérez Escobar Jacobo. Editorial Temis, 1998.\n- Derecho Constitucional Colombiano, Younes Moreno Diego. \n- Obligaciones, Jorge Cubides Camacho.\n- Derecho Comercial, Jose Gabino Pinzón.\n- MADRIÑAN DE LA TORRE, Ramón. Principios de Derecho Comercial. 5  Edición. Santafé de Bogotá D.C. Editorial Temis, 1993.\n- BONIVENTO JIMENEZ, José Alejandro. Los principales Contratos Civiles y su paralelo con los  Comerciales.\n- GOMEZ ESTRADA, César. Los Principales Contratos Civiles.\n- OSPINA FERNANDEZ,- Guillermo. Teoría General del Contrato y de los demás Actos o Negocios.\n- LARROUMET, Christian. NARVAEZ G., Jorge Ignacio. Obligaciones y contratos mercantiles.\n- NARVAEZ GARCIA, José Ignacio, Tipos de Sociedad Editorial Legis\n- NARVAEZ GARCIA, José Ignacio: La Asociación por parte de interés en Colombia, Editorial Legis \n- NARVAEZ GARCIA, José Ignacio: La Sociedad en Comandita Simple, Ediciones Bonnet y Cia S. En C., B \n- NARVAEZ GARCIA, José Ignacio: La Sociedad por Acciones, Editorial Doctrina y Ley"
    }
}