{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "4_PensamientoSistemico_4075",
    "description": "Syllabus de la materia 'PensamientoSistemico' con código '4075'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Pensamiento Sistémico",
        "Nombre Largo de la Asignatura": "Pensamiento Sistémico",
        "Código de la asignatura": "4075",
        "Grado": "Pregrado",
        "Descripción": "El curso presenta el origen y naturaleza del pensamiento sistémico, incluyendo principios, propiedades y métodos provenientes de la dinámica de sistemas, cibernética, y teoría general de sistemas, que ofrecen una alternativa al pensamiento analítico y reduccionista, con el fin de desarrollar en el estudiante una visión holística para la solución creativa de problemas y para el diseño de sistemas y organizaciones.\n\nLa dinámica del curso incluye preparación de lecturas, clases interactivas, laboratorios de simulación y aplicación práctica de metodologías sistémicas en situaciones problemáticas reales",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Cerrada para: Pregrados en Ingeniería /o/ Ciencia de Datos /o/ UCollege Requisitos: Ninguno",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Exponer al estudiante a la simulación con dinámica de sistemas y con agentes, mediante el desarrollo de laboratorios en que se apliquen modelos y herramientas de simulación por computador. \nPresentar los fundamentos conceptuales y métodos de entendimiento, representación y solución de problemas desde una perspectiva sistémica, particularmente a través del uso de arquetipos, heurísticas y de la metodología de sistemas suaves. \nDesarrollar un caso de aplicación de una metodología sistémica al entendimiento y propuesta de intervención de una situación problemática real que les permita a los estudiantes poner en práctica la identificación de factores contextuales y el análisis de impacto técnico, social y ético de las alternativas, al tiempo que contribuye a la identificación de roles y responsabilidades en el trabajo en equipo. \nMostrar el desarrollo conceptual y socio-cultural del pensamiento sistémico a través de la discusión de su historia multidisciplinaria, incluyendo perspectivas ingenieriles, biológicas, cibernéticas, químicas, computacionales, sicológicas y administrativas, entre otras. \nBrindar los principios y propiedades fundamentales del pensamiento sistémico (propiedades emergentes, retroalimentación, sinergia, recursividad, sistemas viables y entropía) a través de la discusión de teorías y casos. \nOfrecer una panorámica del diseño organizacional a partir de la discusión de metáforas organizacionales, enfatizando los problemas de coordinación y el modelo de la organización como sistema abierto.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nRepresentar una situación problemática, a partir de principios holísticos, dando cuenta de su contexto social y ambiental, usando arquetipos sistémicos y metáforas organizacionales. (Disciplinar 2, 3) (CDIO 2.1, 2.3,4.1) \nExplicar elementos del pensamiento sistémico e implicaciones profesionales y éticas en casos reales, mediante la exposición de ejemplos de aplicación de paradigmas y metodologías sistémicas. (Disciplinar 3, 4) (CDIO 2.3, 2.5, 4.1) \nComparar alternativas de intervención que satisfagan requerimientos identificados mediante la aplicación de metodologías sistémicas y principios de toma de decisión multifactor y multicriterio. (Disciplinar 1, 3) (CDIO 2.1, 2.2, 2.3) \nInterpretar modelos simples de simulación con dinámica de sistemas y agentes con el fin de identificar retroalimentación, arquetipos y propiedades emergentes. (Disciplinar 3, 4) (CDIO 2.2, 2.3) \nReconocer la escala individual de autoeficacia y restricciones auto-impuestas para contribuir a la creatividad en la solución de problemas. (Disciplinar 1) (CDIO 2.4)",
        "Contenidos temáticos": "Toma de decisiones y Solución de problemas  \nDiseño Organizacional  \nTeoría General de Sistemas y Cibernética \nDinámica de Sistemas",
        "Estrategias Pedagógicas": "Este curso logra los resultados esperados a través de la preparación previa, por parte de los estudiantes, de la bibliografía asignada. Estas lecturas se verificarán con pruebas de control de lectura y se discutirán grupalmente mediante clases magistrales interactivas. Lo anterior se complementa y profundiza a través de exposiciones preparadas grupalmente por los estudiantes. \n\nAdicionalmente, se desarrollarán talleres y laboratorios de simulación para apropiar los principios y métodos presentados.  \n\nFinalmente, a lo largo del curso se aborda el entendimiento, análisis y propuesta de intervención ante una situación problemática del mundo real, mediante la aplicación de una metodología sistémica, de manera grupal.",
        "Evaluación": "Las estrategias de evaluación están centradas en la valoración de los resultados de aprendizaje esperado de la asignatura; las cuales pueden ser formativas que suscitan la comprensión y construcción de conocimiento, y sumativas que incluyen porcentajes de evaluación con el fin de corroborar el logro de los aprendizajes y el desarrollo de las competencias en los estudiantes.  \n\nPuntualmente, la asignatura incluye los siguientes componentes y porcentajes de evaluación: \n\nExamen parcial: 20%  \nExposiciones: 20%  \nLaboratorios: 20%  \nQuices: 10%  \nEntrega #1 de Proyecto: 10% \nEntrega #2 de Proyecto: 10% \nEntrega #3 de Proyecto: 10%",
        "Recursos Bibliográficos": "Bell, S., Berg, T., & Morse, S. (2019). Towards an Understanding of Rich Picture Interpretation. Systemic Practice and Action Research, 32(6), 601-614. https://doi.org/10.1007/s11213-018-9476-5 \nClancy, T. (2018). Systems Thinking: Three System Archetypes Every Manager Should Know. IEEE Engineering Management Review, 46(2), 32-41. https://doi.org/10.1109/EMR.2018.2844377 \nCummings, T. G. (2015). Closed and Open Systems: Organizational. En J. D. Wright (Ed.), International Encyclopedia of the Social & Behavioral Sciences (Second Edition) (pp. 893-896). Elsevier. https://doi.org/10.1016/B978-0-08-097086-8.73114-X \nDamenu, T. K., & Beaumont, C. (2017). Analysing information security in a bank using soft systems methodology. Information & Computer Security, 25(3), 240-258. https://doi.org/10.1108/ICS-07-2016-0053 \nGoh, Y. M., Brown, H., & Spickett, J. (2010). Applying systems thinking concepts in the analysis of major incidents and safety culture. Safety Science, 48(3), 302-309. https://doi.org/10.1016/j.ssci.2009.11.006 \nGonzalez, R. A., Verbraeck, A., & Dahanayake, A. (2010). Extending the Information-Processing View of Coordination in Public Sector Crisis Response. International Journal of Electronic Government Research (IJEGR), 6(4), 25-44. https://doi.org/10.4018/jegr.2010100103 \nHester, P. T., & Adams, K. MacG. (2017a). Problems and Messes. En P. T. Hester & K. MacG. Adams (Eds.), Systemic  Decision Making: Fundamentals for Addressing Problems and Messes (pp. 17-34). Springer International Publishing. https://doi.org/10.1007/978-3-319-54672-8_2 \nHester, P. T., & Adams, K. MacG. (2017b). Systems Theory. En P. T. Hester & K. MacG. Adams (Eds.), Systemic  Decision Making: Fundamentals for Addressing Problems and Messes (pp. 55-99). Springer International Publishing. https://doi.org/10.1007/978-3-319-54672-8_4 \nIsa, W. A. R. W. M., Suhaimi, A. I. H., Noordin, N., Harun, N. A., Mohammed, S. N. A. S., Jamil, A. I., Ariffin, S. N. M., & Addenan, N. S. (2023). Hunger hero mobile application: Applying soft system methodology at a local orphanage. International Journal of Information Technology (Singapore), 15(2), 691-696. Scopus. https://doi.org/10.1007/s41870-022-01101-w \nJonassen, D. H. (2012). Designing for decision making. Educational Technology Research and Development, 60(2), 341-359. https://doi.org/10.1007/s11423-011-9230-5 \nMcCabe, D. (2016). `Curiouser and curiouser!¿: Organizations as Wonderland ¿ a metaphorical alternative to the rational model. Human Relations, 69(4), 945-973. https://doi.org/10.1177/0018726715618453 \nSiegenfeld, A. F., & Bar-Yam, Y. (2020). An Introduction to Complex Systems Sci"
    }
}