{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "5_IntroduccionALaIngenieria_33763",
    "description": "Syllabus de la materia 'IntroduccionALaIngenieria' con código '33763'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Introducción a la ingeniería",
        "Nombre Largo de la Asignatura": "Introducción a la ingeniería",
        "Código de la asignatura": "33763",
        "Grado": "Pregrado",
        "Descripción": "La asignatura de Introducción a la Ingeniería pretende dar a conocer de forma general la definición y propósitos de la Ingeniería, cuáles son las habilidades que debe tener y desarrollar un ingeniero, y cuál es el impacto social.\nDe forma particular se trabajarán los aspectos específicos de cada una de las áreas de la Ingeniería, cuáles son las habilidades que deben tener y desarrollar los estudiantes y sus campos de aplicación. En esta asignatura se le darán elementos al estudiante para que pueda descubrir si la profesión escogida, dentro de la ingeniería, se acopla con sus destrezas y sus sueños.",
        "Número de Créditos": "2",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Cerrada Ingenierías y UCollege Javeriano, Economía, Microbiología Industrial, Diseño Industria, Biología, Comunicación Social",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Brindar los conceptos fundamentales sobre la ingeniería y su relación con la sociedad\nExplorar diferentes perfiles de formación para cada una de las áreas de la Ingeniería (según programa base del estudiante) y contrastarlos con los objetivos de formación en la Universidad Javeriana \nFacilitar al estudiante el conocimiento de las principales áreas que hacen parte de la profesión (según programa base del estudiante)\nPresentar los diferentes campos de acción del ingeniero (según programa base del estudiante) y la interrelación con otras disciplinas. \nBrindar espacios de reflexión sobre los intereses, habilidades y proyecciones del futuro de los estudiantes y la relación con su vocación profesional. \nDesarrollar habilidades de liderazgo, trabajo en equipo y comunicación propias del Ingeniero.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nIdentificar roles y responsabilidades del Ingeniero con la sociedad y su entorno, y en particular del área (según programa base del estudiante), al profundizar en conceptos generales de la profesión (Disciplinar 1,2,4) (CDIO 2.5, 4.1)\nIdentificar el funcionamiento de un sistema mediante las etapas en el proceso de diseño en ingeniería. (Disciplinar 3) (CDIO: 2.3.1) \nFormular de manera creativa e innovadora una iniciativa de creación de un producto describiendo los componentes del proyecto (CDIO: 2.4.2.3; Disciplinar 3)\nTener conciencia de las habilidades, actitudes, fortalezas, debilidades y formas de pensamiento propios frente a lo que es la Ingeniería y el enfoque particular javeriano. (Disciplinar 1,2) (CDIO: 2.4) \nExplicar la responsabilidad profesional del Ingeniero y la importancia de adoptar un código de ética en la solución de problemas de la sociedad (Disciplinar 1,2) (CDIO 2.4, 2.5, 4.1)\nExpresar asertivamente información sobre la ingeniería y su contexto social y resultados de un proyecto de diseño de ingeniería.\nReconocer las condiciones necesarias de un trabajo en equipo para un proyecto de diseño en ingeniería.",
        "Contenidos temáticos": "1. La Ingeniería y su contexto social. \n- Qué es la ingeniería\n- Historia de la Ingeniera. \n- Ciencia, Tecnología e Ingeniería. \n- Contexto social de la Ingeniería. \n\n2. Definiciones, perfiles, áreas y campos de acción del ingeniero (según programa base del estudiante)\n- Evolución, razón de ser y futuro. \n- Diferentes áreas de aplicación (según programa base).\n- Habilidades del Ingeniero (según programa base)\n- Responsabilidad profesional y ética del ingeniero. \n- La carrera en la Universidad Javeriana (según programa base) y el perfil del ingeniero javeriano. \n- Plan de estudios (según programa base)\n\n3. Proceso de diseño en ingeniería y gestión de proyectos.\n- Método científico: observación del fenómeno, análisis de los datos, para formulación del problema: causa raíz\n- Sostenibilidad de la solución\n- Innovación y creatividad\n- Restricciones y limitaciones\n- Generación de soluciones",
        "Estrategias Pedagógicas": "Para el logro de los objetivos y resultados, el curso utilizará como estrategias pedagógicas, clases magistrales interactivas y discusión de casos, en las que se contará con la participación activa de los estudiantes, dado que previamente se les suministrarán lecturas, en español o en inglés, que servirán de guía para preparar los temas que se tratarán en cada sesión. Adicionalmente, en el proyecto del curso, el estudiante aplicará herramientas básicas de su programa base. Finalmente, a través del contacto con estudiantes de último semestre y con egresados, se pondrá al estudiante frente a experiencias profesionales con las cuales contrastará la teoría con la realidad profesional.",
        "Evaluación": "COMPONENTE FECHA PORCENTAJE\nCOMPONENTE ESPECIFICO\n- Según disciplina Fechas estipuladas en calendario: 30%\n\nCOMPONENTE GENERAL\n- Parcial Semana 08: 20%\n- Trabajos, talleres, quices Trabajos, talleres, quices Todo el semestre: 15%\n- Trabajo Responsabilidad Social Empresarial RSE Durante el semestre según calendario: 5%\n- Trabajo final Trabajo aplicación grupal, final Todo el semestre: 30%",
        "Recursos Bibliográficos": "Beekman, G. (2009). Tomorrows Technology and you, ninth edition. London: Pearson. \nGrech, P. (2003). Introducción a la Ingeniería. Bogotá: Prentice Hall. International Council of Systems Engineering. (s.f.). www.incose.org. \nUniversidad Javeriana- Centro de Escritura-. (s.f.). Normas APA sexta edicion. Obtenido de http://www.javeriana.edu.co/cuadrantephi/pdfs/8.pdf. \nZavala Trias, S. (septiembre de 2009). Guía a la redacción en el estilo. Obtenido de http://www.cibem.org/paginas/img/apa6.pdf \nEspecificas (según programa base)"
    }
}