{
    "version": "1.0",
    "last_updated": "2024-08-20",
    "title": "8_AlgebraLineal_1290",
    "description": "Syllabus de la materia 'AlgebraLineal' con código '1290'",
    "access_control": "privado",
    "content": {
        "Nombre Corto de la Asignatura": "Álgebra Lineal",
        "Nombre Largo de la Asignatura": "Álgebra Lineal",
        "Código de la asignatura": "1290",
        "Grado": "Pregrado",
        "Descripción": "El álgebra lineal es el área de las matemáticas que estudia los espacios vectoriales. En estos espacios se definen objetos como vectores, matrices, sistemas lineales, sus propiedades y operaciones, lo mismo que funciones lineales entre espacios vectoriales.\n\nPor medio de las operaciones en espacios vectoriales se puede representar, por ejemplo, en campos tan estudiados como la física, la posición de una partícula que se desplaza en el espacio, su velocidad, la aceleración, sus componentes normales y tangenciales, etc. Por otro lado, en campos relativamente nuevos como la ciencia de datos, el entendimiento conceptual de las matrices y vectores y sus interconexiones con el manejo de la información son esenciales para los desarrollos en ciencia e ingeniería.",
        "Número de Créditos": "3",
        "Condiciones Académicas de Inscripción (Pre-requisitos)": "Sin condiciones",
        "Período Académico de Vigencia": "2430",
        "Objetivos de Formación": "Presentar las técnicas y el lenguaje matemático del álgebra lineal, para identificar, modelar y solucionar problemas lineales que se pueden representar por medio de sistemas de ecuaciones lineales, matrices, vectores en espacios vectoriales.",
        "Resultados de Aprendizaje Esperados (RAE)": "Al finalizar el curso el estudiante estará en capacidad de:\nIdentificar espacios vectoriales y sus operaciones.\nSuma y producto por escalar en espacios vectorial sobre los reales.\nOperar con vectores: realizar e identificar las operaciones en espacios vectoriales, suma, resta y producto por escalar.\nIdentificar la relación de paralelismo entre vectores y las formas paramétricas de rectas y planos para describir estos objetos en espacios generales.\nUsar el producto punto en Rn para reconocer, construir e identificar vectores perpendiculares que determinan las formas cartesianas de rectas y planos en los R2 y R3 respectivamente.\nCalcular ecuaciones paramétricas y cartesianas de rectas y planos.\nReconocer la perpendicularidad como concepto fundamentar para la solución de los problemas de optimización. \nDistancia mínima.\nCalcular distancias, áreas y volúmenes de figuras geométricas como paralelogramos, triángulos y paralelepípedos, usando la norma, las proyecciones de vectores y las operaciones de producto punto y producto cruz.\nReconocer la solución de los sistemas de ecuaciones lineales como expresiones que describen y caracterizan puntos, rectas, planos etc., en espacios vectoriales en forma paramétrica.\nHallar soluciones a sistemas de ecuaciones lineales.\nReconocer e identificar propiedades geométricas de las matrices dadas sus operaciones sobre vectores. \nRotaciones, proyecciones, reflexiones y cambio de escala.\nIdentificar matrices especiales y aplicar sus propiedades. \nConstruir matrices elementales y sus inversas, matrices simétricas, la matriz transpuesta.\nReconocer el producto de matrices en varios contextos: composición de transformaciones, cambios de bases en espacios vectoriales, factorización de matrices, algoritmos para solución de sistemas de ecuaciones.\nReconocer y usar las combinaciones lineales para entender los productos de matrices, las ecuaciones cartesianas y paramétricas de rectas, planos, etc., y la construcción de subespacios.\nExplicar las relaciones de dependencia e independencia lineal en conjuntos de vectores.\nConstruir bases de espacios y subespacios vectoriales.\nUsar los métodos de solución de sistemas de ecuaciones lineales para reconocer procesos de factorización de matrices los cuales aportan información sobre la estructura de los datos de la matriz, o que generan factorización de matrices.\nRealizar la factorización CR de una matriz y explicar las relaciones entre las columnas de la matriz.\nUsar las operaciones fila de una matriz para calcular la matriz inversa.\nIdentificar cuando una matriz no es invertible.\nReconocer las matrices como transformaciones lineales entre espacios vectoriales.\nReconocer las propiedades del determinante. Aplicar las propiedades del determinante. \nCalcular determinantes usando sus propiedades y las fórmulas usuales del determinante.\nUsar el determinante para reescribir conceptos vistos anteriormente: áreas, volúmenes, so-luciones de ecuaciones, matriz inversa.\nReconocer el concepto de dimensión y realizar cómputo de dimensiones de subespacios a partir del teorema de la dimensión de los subespacios de una transformación lineal.\nIdentificar las relaciones del núcleo y la imagen de una transformación lineal con la solución de sistemas homogéneos y no homogéneos.\nConstruir bases ortonormales de espacios vectoriales, usando el proceso de Gram-Schmidt. \nCalcular la proyección ortogonal de vectores sobre subespacios.\nCalcular la factorización QR de una matriz con columnas linealmente independientes.\nCalcular valores propios, vectores y subespacios propios de matrices cuadradas. \nHallar bases de vectores propios. \nDiagonalizar matrices.\nDeterminar si una matriz puede ser o no diagonalizable.\nDiagonalizar matrices simétricas.\nCalcular los valores singulares de una matriz.\nCalcular la descomposición en valores singulares de una matriz.",
        "Contenidos temáticos": "Vectores euclidianos: plano y espacio tridimensional.\nVectores en Rn, adición, multiplicación por escalar de vectores, combinación lineal de vectores, producto punto, ángulo entre vectores, vectores paralelos y perpendiculares, longitud, producto cruz, producto mixto, proyección de un vector sobre otro, vector unitario, determinantes 2X2 y 3X3, área del paralelogramo y volumen del paralelepípedo. \n-\tEcuaciones cartesianas y paramétricas de recta y planos.\n\nSistemas de ecuaciones lineales.\n-\tMatrices, definición de matriz identidad, matriz inversa. \n-\tTransposición de matrices y sus propiedades. \n-\tMatriz simétrica. \n-\tProducto matriz-vector, matriz-matriz. \n-\tPropiedades de linealidad del producto matriz-vector, noción de transformación lineal. \n-\tRepresentación matricial de sistemas de ecuaciones lineales.\n-\tOperaciones por fila y matrices elementales. \n-\tSolución de sistemas de ecuaciones lineales, Método de Gauss ¿ Jordan, factorización de matrices CR y LU. \n-\tAplicación de la factorización LU a la solución de sistemas de ecuaciones. \n-\tAplicación de la factorización CR para identificar relaciones entre vectores. \n\nDeterminantes.\n-\tDefinición y propiedades. \n-\tInversa de una matriz.\n\nSubespacios asociados a una matriz en Rn\n-\tSubespacios vectoriales. \n-\tIndependencia lineal, conjunto generador, base y dimensión.\n-\tEspacio fila. \n-\tEspacio columna. \n-\tRango de una matriz y de un sistema de ecuaciones lineales. \n-\tTransformación lineal. \n-\tMatriz asociada a una transformación. \n-\tMatriz asociada a la composición de transformaciones lineales. \n-\tCambio de base. \n-\tNúcleo e imagen. \n-\tTransformaciones inyectivas, sobreyectivas y biyectivas.\n\nOrtogonalidad \n-\tDefinición y propiedades. \n-\tConjuntos ortogonales. \n-\tBases ortogonales. \n-\tMétodo de ortonormalización de Gram¿Schmidt. \n-\tDescomposición QR de una matriz. Isometrías: preservación de longitudes y ángulos. \n-\tMatrices ortogonales y unitarias. \n-\tComplemento ortogonal y suma directa. \n-\tProyecciones ortogonales: representación. \n-\tMétodo de los mínimos cuadrados lineales.\n\nDiagonalización de matrices.\n-\tDefinición y propiedades. \n-\tDefinición de valores y vectores propios. Propiedades. \n-\tMultiplicidad algebraica y geométrica de un valor propio.\n-\t Diagonalización de matrices. \n-\tDiagonalización de matrices simétricas. \n-\tAplicación a valores singulares de una matriz. \n-\tPropiedades.  \n-\tDescomposición de una matriz en valores singulares. \n-\tPropiedades geométricas. \n-\tAproximación de bajo rango.",
        "Estrategias Pedagógicas": "Esta asignatura tiene una metodología de clase magistral interactiva, en donde la apropiación del conocimiento se realiza a través de la resolución de problemas. Es así como el estudiante parte de unos conceptos que debe aplicar para representar matemáticamente el problema. En consecuencia, el estudiante está llamado a proponer una solución válida al mismo, y a hacer un análisis posterior que tenga en cuenta la solución propuesta dentro del contexto del problema. Adicionalmente, cada taller en clase busca un aprendizaje entre pares donde el estudiante puede argumentar y discutir las posibles representaciones matemáticas para un problema dado, así como los resultados obtenidos.",
        "Evaluación": "Primer parcial, 25%.\nSegundo parcial, 25%.\nTercer parcial, 25%.\nTareas, talleres, pruebas cortas, presentaciones del estudiante o trabajos escritos, 25%.",
        "Recursos Bibliográficos": "Larson, Roy, Elementary Linear Algebra, Cengage, 2018.\nLay, David C., Lay, Steven R., McDonald, Judi J, Linear Algebra and Its Applications, Sixth edition. Pearson, 2022.\nRoberts, A.J., Linear Algebra for the 21st century, Oxford University Press, 2020.\nStrang, Gilbert, Introduction to Linear Algebra, Sixth edition, Wellesley-Cambridge Press, 2023."
    }
}